{"updated_label":"faulty generalization","source_article":"\"Annie must like Starbucks because all white girls like Starbucks.\""}
{"updated_label":"faulty generalization","source_article":"It is warmer this year in Las Vegas as compared to last year; therefore, global warming is rapidly accelerating."}
{"updated_label":"faulty generalization","source_article":"\"The two courses I took at UF were not very interesting. I don't think its a good university.\""}
{"updated_label":"faulty generalization","source_article":"A driver with a New York license plate cuts you off in traffic. You decide that all New York drivers are terrible drivers."}
{"updated_label":"faulty generalization","source_article":"\"Four out of five dentists recommend Happy Glossy toothpaste. Therefore, it must be great.\""}
{"updated_label":"faulty generalization","source_article":"No one in your family surfs? But I thought you said you lived in California before this."}
{"updated_label":"faulty generalization","source_article":"Kevin's grandparents do not know how to use a computer. Kevin thinks that all older people must be computer illiterate."}
{"updated_label":"faulty generalization","source_article":"If you eat a good diet, you will never have a heart attack."}
{"updated_label":"faulty generalization","source_article":"Everyone knows that teenagers are lazy"}
{"updated_label":"faulty generalization","source_article":"MeowMeowTweet is American-made skincare. I used it, and it gave me zits. American-made skincare gives people acne."}
{"updated_label":"faulty generalization","source_article":"All teachers drink coffee and teachers are people; therefore, all people drink coffee."}
{"updated_label":"faulty generalization","source_article":"All four year olds talk too much."}
{"updated_label":"faulty generalization","source_article":"I met a tall man who loved to eat cheese. Now I believe that all tall people like cheese."}
{"updated_label":"faulty generalization","source_article":"I know three redheads who have terrible tempers, and since Annabel has red hair, I’ll bet she has a terrible temper too."}
{"updated_label":"faulty generalization","source_article":"We think this new MallTime game app will be a success because all girls like shopping."}
{"updated_label":"faulty generalization","source_article":"People from big cities are not as friendly as those from small towns."}
{"updated_label":"faulty generalization","source_article":"“My roommate Fatima said her philosophy class was hard, and the one I’m in is hard, too. All philosophy classes must be hard!” Insisted Baneen."}
{"updated_label":"faulty generalization","source_article":"I was just on the phone with a Southerner, and I could barely keep up! All Southerners talk fast."}
{"updated_label":"faulty generalization","source_article":"I have several female friends and every one of them loves country music. All females love country music."}
{"updated_label":"faulty generalization","source_article":"That type of car is poorly made; a friend of mine has one, and it continually gives him trouble."}
{"updated_label":"faulty generalization","source_article":"Everyone loves Post Malone and can name at least one of his songs! (This is an example of...)"}
{"updated_label":"faulty generalization","source_article":"We think this new MallTime game app will be a success because all little girls like shopping."}
{"updated_label":"faulty generalization","source_article":"I saw a student texting in my class yesterday; all my students must be texting, so cell phones should be banned."}
{"updated_label":"faulty generalization","source_article":"“The two courses I took at Harvard were not very interesting. I don't think it is a good university.”"}
{"updated_label":"faulty generalization","source_article":"“Birds can fly; therefore, penguins can fly.”"}
{"updated_label":"faulty generalization","source_article":"I can't understand why people are complaining that it's difficult to find a job in this job market. My daughter and I got jobs without any trouble."}
{"updated_label":"faulty generalization","source_article":"On my walk to work this morning, a woman on her bike nearly ran me off the sidewalk. I hadn't realized that cyclists were so aggressive and rude!"}
{"updated_label":"faulty generalization","source_article":"The government is convinced that it was a bomb that brought down the aircraft. “Our countrymen believe it was a bomb,” said the president. “A survey done a few days after the crash indicates that almost seventy percent of the people believe it was a terrorist’s bomb.”"}
{"updated_label":"faulty generalization","source_article":"All of those who hate the Duterte administration are CPP-NPA supporters."}
{"updated_label":"faulty generalization","source_article":"Mrs. Miller taught your older brother, who was the class clown. She decides to be strict with you from the very first day of class because she thinks you will be a clown, too."}
{"updated_label":"faulty generalization","source_article":"\"You shouldn't go to 'Vomito' I went once and the food was awful.\" is"}
{"updated_label":"faulty generalization","source_article":"\"Avoid Latam Airlines. Their planes are always late\" is what kind of fallacy?"}
{"updated_label":"faulty generalization","source_article":"Two of my best friends are really introverted, shy people, and they both have cats. That leads to me believe that most cat lovers are really shy."}
{"updated_label":"faulty generalization","source_article":"I've only read a couple pages of this book, and I've already found a typo. There's no way I'm reading the rest of this garbage."}
{"updated_label":"faulty generalization","source_article":"Christine has a terrible experience with a boyfriend. She decides that all boys are mean."}
{"updated_label":"faulty generalization","source_article":"My roommate from Maine loves lobsters, therefore all people from Maine love lobsters."}
{"updated_label":"faulty generalization","source_article":"The spider that bit was poison, therefore all spiders are poison."}
{"updated_label":"faulty generalization","source_article":"The child did not do his chores so therefore all children are lazy."}
{"updated_label":"faulty generalization","source_article":"The teenagers where rude and disrespectful therefore all teenagers are rude and disrespectful."}
{"updated_label":"faulty generalization","source_article":"This guy in my class with glasses always talks in class so all guys with glasses are talkative."}
{"updated_label":"faulty generalization","source_article":"I met a rude person from France yesterday. I guess all French people are rude."}
{"updated_label":"faulty generalization","source_article":"“Because young male drivers are twice as likely to get into a car accident, they should pay more for car insurance.”"}
{"updated_label":"faulty generalization","source_article":"Alissa has class with a football player who is a class clown. He disrupts the class and is failing. Alissa decides all football players are not serious students."}
{"updated_label":"faulty generalization","source_article":"Fred, the German, stole my wallet. Therefore, all Germans are thieves."}
{"updated_label":"faulty generalization","source_article":"Four out of five dentists recommend Happy Glossy Smiley toothpaste brand. Therefore, it must be great."}
{"updated_label":"faulty generalization","source_article":"\"Even though it's only the first day, I can tell this is going to be a boring course.\""}
{"updated_label":"faulty generalization","source_article":"Southerners talk fast. I was just on the phone with one, and I could barely keep up!"}
{"updated_label":"faulty generalization","source_article":"I have a red car. My car was in a wreck. Therefore, all red cars get wrecked."}
{"updated_label":"faulty generalization","source_article":"“There aren’t any good restaurants in Sydney; I tried two and they were both horrible.”"}
{"updated_label":"faulty generalization","source_article":"Why did the blond cross the road?  Because she saw a shoe sale!"}
{"updated_label":"faulty generalization","source_article":"Everyone who gets a college degree is better off.  All people who are better off as a result of getting a degree are good to have conversations with.  Therefore, everyone who gets a college degree is a good person to have a conversation with."}
{"updated_label":"faulty generalization","source_article":"People who wear glasses are smarter."}
{"updated_label":"faulty generalization","source_article":"All tall people are good basketball players."}
{"updated_label":"faulty generalization","source_article":"Women can't do as good a job as men."}
{"updated_label":"faulty generalization","source_article":"All people who live in England have bad teeth."}
{"updated_label":"faulty generalization","source_article":"Pre-AP kids are smart and creative."}
{"updated_label":"faulty generalization","source_article":"My job interview did not go well. I'll never get a job."}
{"updated_label":"faulty generalization","source_article":"Look at people like Michael Vick and OJ Simpson. Professional athletes really have no sense of morality."}
{"updated_label":"faulty generalization","source_article":"Teenagers are too immature and self-absorbed to understand anything about global issues."}
{"updated_label":"faulty generalization","source_article":"My cat sleeps all day, so cats must be pretty lazy."}
{"updated_label":"faulty generalization","source_article":"“People nowadays only vote with their emotions instead of their brains.”"}
{"updated_label":"faulty generalization","source_article":"Parents today would rather their kids suppress their identity rather than just be who they are even if it doesn't go with the norm."}
{"updated_label":"faulty generalization","source_article":"\"I have one Japanese friend and it's true that all of them are numb.\""}
{"updated_label":"faulty generalization","source_article":"\"Annie must like Starbucks because all girls like Starbucks.\""}
{"updated_label":"faulty generalization","source_article":"There are no good restaurants in New York; I tried two in Times Square, and they were awful."}
{"updated_label":"faulty generalization","source_article":"\"Everyone wants to be an English teacher.\""}
{"updated_label":"faulty generalization","source_article":"\"Sarah likes to run. All girls must like to run.\""}
{"updated_label":"faulty generalization","source_article":"\"No one stops to process...No one appreciates the value\" is an example of"}
{"updated_label":"faulty generalization","source_article":"\"My uncle eats pizza and cake and he is thin. Pizza and cake aren’t the cause of obesity. \" is an example of"}
{"updated_label":"faulty generalization","source_article":"\"Some tall people recently vandalized the park, tall people are irresponsible.\""}
{"updated_label":"faulty generalization","source_article":"Sarah loves to wear running shoes, all girls must like to run."}
{"updated_label":"faulty generalization","source_article":"My parents are democrats, and they are good people. Therefore, all democrats must be good people."}
{"updated_label":"faulty generalization","source_article":"\"All Muslims are terrorists\" is an example of"}
{"updated_label":"faulty generalization","source_article":"I can tell this movie is going to be terrible; the opening credits aren't even over yet!"}
{"updated_label":"faulty generalization","source_article":"\"Everyone who likes pizza likes pepperoni\" is an example of"}
{"updated_label":"faulty generalization","source_article":"Teachers don't have lives.\"My best friend said her English class was hard, and the one I'm in is hard too. All English classes must be hard.\""}
{"updated_label":"faulty generalization","source_article":"\"My cousin said her Math class was hard. The one that I’m in is hard too. All Math classes must be hard.\"\r\nThis statement is an example of…"}
{"updated_label":"faulty generalization","source_article":"All chess players are geniuses."}
{"updated_label":"faulty generalization","source_article":"Trying to finish a marathon is impossible, I know because I tried it once."}
{"updated_label":"faulty generalization","source_article":"Saying things like \"ALL teenagers are irresponsible\" would be an example of which type of fallacy?"}
{"updated_label":"faulty generalization","source_article":"\"The two courses I took at UWI were not very interesting. I don't think its a good university.\""}
{"updated_label":"faulty generalization","source_article":"My dog got sprayed by a skunk this morning on the trail; therefore, trail running is dangerous."}
{"updated_label":"faulty generalization","source_article":"I can't trust the mayor or the governor. All politicians must be liars."}
{"updated_label":"faulty generalization","source_article":"All writing teachers must be awesome because Ms. Lopez is."}
{"updated_label":"faulty generalization","source_article":"You have a friend who claims that cats like to go to windows and watch sunsets because that is what her cats does. What fallacy has she committed?"}
{"updated_label":"faulty generalization","source_article":"\"I don't know how to complete my geometry homework tonight; I probably can't pass the course since I can't do this one assignment.\""}
{"updated_label":"faulty generalization","source_article":"Two members of my team have become more engaged employees after taking public speaking classes. That proves we should have mandatory public speaking classes for the whole company to improve employee engagement."}
{"updated_label":"faulty generalization","source_article":"A lion is a cat and cats are good pets so a lion must be a good pet."}
{"updated_label":"faulty generalization","source_article":"All of my red-headed friends are good dancers. Therefore, all red-headed people must be good dancers. \r\nThis assumption from my experience is an example of"}
{"updated_label":"faulty generalization","source_article":"My neighbor's cat attacked me, therefore all cats are evil."}
{"updated_label":"faulty generalization","source_article":"Sometimes flu vaccines don’t work, therefore vaccines are useless."}
{"updated_label":"faulty generalization","source_article":"I saw two women get in a car accident. Therefore, all women are bad drivers"}
{"updated_label":"faulty generalization","source_article":"I saw that dog eat chicken so all dogs must only eat chicken."}
{"updated_label":"faulty generalization","source_article":"My mom says that most tourist from France are rude. She had to wait on one the other day and the lady threw her pancakes on the ground because they were not big enough."}
{"updated_label":"faulty generalization","source_article":"There was a fight at school today. Violence is a growing problem in school."}
{"updated_label":"faulty generalization","source_article":"We should go inside; the last time the clouds were that dark, there was a tornado."}
{"updated_label":"faulty generalization","source_article":"My Aunt was in the hospital for 6 weeks because she didn't wear a seatbelt."}
{"updated_label":"faulty generalization","source_article":"I work out in the morning because it worked for my friend."}
{"updated_label":"faulty generalization","source_article":"A few students are misbehaving...therefore the whole class is bad. What fallacy is this an example of?"}
{"updated_label":"faulty generalization","source_article":"Three kids in one class failed the Jane Eyre quiz, I guess,all the other classes will all fail it, too."}
{"updated_label":"faulty generalization","source_article":"Chihuahuas are good inside dogs. German Shepherds are dogs; therefore, German Shepherds would be good inside dogs, too."}
{"updated_label":"faulty generalization","source_article":"Girls should not be allowed . to try out as kickers for school football teams because girls are not very athletic."}
{"updated_label":"faulty generalization","source_article":"Some students who attend tutoring over the summer are not very intelligent. Since Beth attended summer tutoring, she is not a very good student."}
{"updated_label":"faulty generalization","source_article":"All students are good and all clowns are bad."}
{"updated_label":"faulty generalization","source_article":"Even though people say we are going to behave; we know they won't behave well."}
{"updated_label":"faulty generalization","source_article":"My parents are vegetarians, and they are good people. Therefore, all vegetarians must be good people."}
{"updated_label":"faulty generalization","source_article":"The meteorologist predicted the wrong amount of rain for May. Obviously the meteorologist is unreliable."}
{"updated_label":"faulty generalization","source_article":"My first day of basketball practice was easy, so it will always be easy."}
{"updated_label":"faulty generalization","source_article":"My first time meeting Mr. Casal went poorly, so his class will not be a good one this year."}
{"updated_label":"faulty generalization","source_article":"My first time walking the dog went terribly, so my dog is a terrible one."}
{"updated_label":"faulty generalization","source_article":"The first time I went to Six Flags was great, so every time I go there will be great."}
{"updated_label":"faulty generalization","source_article":"After I listened to the first song of my favorite musician’s new vinyl record, I knew I’d hate the entire record, so I converted it into a Frisbee."}
{"updated_label":"faulty generalization","source_article":"My car broke down yesterday. Cars are worthless."}
{"updated_label":"faulty generalization","source_article":"He has smoked cigarettes his entire life and he doesn't have lung cancer. Therefore smoking doesn't cause lung cancer."}
{"updated_label":"faulty generalization","source_article":"\"Blondes are less intelligent than people with other hair colors.\""}
{"updated_label":"faulty generalization","source_article":"\"You were late tonight. You must be cheating!\""}
{"updated_label":"faulty generalization","source_article":"While doing research for her debate topic on school uniforms, Sara discovered that a local elementary school survey indicated that 72% of its 1st graders wanted uniforms. She used this as evidence to support that all high schools should wear school uniforms.\r\nWhat fallacy did Sara use here?"}
{"updated_label":"faulty generalization","source_article":"\"My roommate said her Debate class was hard, and the one that I'm in right now is hard, too. All Debate classes must be hard!”"}
{"updated_label":"faulty generalization","source_article":"Jack is a good athlete. Jack comes from Canada. Therefore, all Canadians are good athletes."}
{"updated_label":"faulty generalization","source_article":"In both of the murder mysteries I have read, the District Attorney was the culprit. All mystery writers like to make lawyers out to be villains."}
{"updated_label":"faulty generalization","source_article":"I asked six of my friends what they thought of the new spending restraints and they agreed it is a good idea. The new restraints are therefore generally popular."}
{"updated_label":"faulty generalization","source_article":"Because cases spiked rapidly in New York City back in March, it justified us closing down the whole country."}
{"updated_label":"faulty generalization","source_article":"\"All sports car drivers are too aggressive!\" is an example of:"}
{"updated_label":"faulty generalization","source_article":"All required university courses are boring."}
{"updated_label":"faulty generalization","source_article":"Happy families make happy children."}
{"updated_label":"faulty generalization","source_article":"Science fiction books are not worth the time it takes to read them."}
{"updated_label":"faulty generalization","source_article":"One of our clients doubled their conversions after changing all their landing page text to bright red. Therefore, changing all text to red is a proven way to double conversions."}
{"updated_label":"faulty generalization","source_article":"My sister loves shopping, so all girls must love to shop too."}
{"updated_label":"faulty generalization","source_article":"People who learn from their mistakes don't repeat them."}
{"updated_label":"faulty generalization","source_article":"All women care about are their looks."}
{"updated_label":"faulty generalization","source_article":"Asians make lousy athletes, but do well at the Math Olympiad."}
{"updated_label":"faulty generalization","source_article":"White men can't jump. No, really, they can't!"}
{"updated_label":"faulty generalization","source_article":"Nobody thinks homelessness is a good thing."}
{"updated_label":"faulty generalization","source_article":"Within every man's heart is the desire to be free."}
{"updated_label":"faulty generalization","source_article":"You can tell that guy's Mexican - he's wearing a sombrero."}
{"updated_label":"faulty generalization","source_article":"My grandfather was a typical Irishman - friendly, outgoing, and drunk half the time."}
{"updated_label":"faulty generalization","source_article":"I know three redheads who have terrible tempers, and since Annabel has red hair, I’ll bet she has a terrible temper, too."}
{"updated_label":"faulty generalization","source_article":"Supreme Court Justice Byron White was an All-American football player while in college, so how can you say that athletes are dumb?"}
{"updated_label":"faulty generalization","source_article":"“She was wearing cowboy boots in her last Instagram picture so she must be into country music.”"}
{"updated_label":"faulty generalization","source_article":"\"The building is closed. I saw 2 people standing outside the door.\"What is this type of logical fallacy?"}
{"updated_label":"faulty generalization","source_article":"\"I asked my five closest friends and they all agree that the new Underwater Basketweaving Team Coach is a jerk, therefore I'm not trying out for the team\" IS an example of THIS fallacy."}
{"updated_label":"faulty generalization","source_article":"\"The Omani hospital tested three patients from Abu Dhabi and found they had the disease. They immediately banned all people from Abu Dhabi from entering the hospital.\""}
{"updated_label":"faulty generalization","source_article":"My father smoked four packs of cigarettes a day since age fourteen and lived until age sixty-nine. Therefore, smoking really can’t be that bad for you."}
{"updated_label":"faulty generalization","source_article":"The students in my sixth-grade class listen to a lot of reggaeton music. I usually hear reggaeton when they have their headphones or earphones on while working on NoRedInk. All sixth graders must listen to reggaeton.\r\n\r\nWhat type of faulty reasoning is being used?"}
{"updated_label":"faulty generalization","source_article":"Three congressional representatives have had affairs. Members of Congress are adulterers."}
{"updated_label":"faulty generalization","source_article":"\"Guys are messy and unclean, but are really hard workers.\" is an example of ..."}
{"updated_label":"faulty generalization","source_article":"\"Flight attendants are the nicest people. I should know—I’ve taken two flights.\""}
{"updated_label":"faulty generalization","source_article":"\"Everyone loves going to the movies.\""}
{"updated_label":"faulty generalization","source_article":"Miller Lite is cheap beer, so the Guinness will be cheap, too"}
{"updated_label":"faulty generalization","source_article":"Democrats are gay and Republicans are rich."}
{"updated_label":"faulty generalization","source_article":"I would never buy a Buick. My father owned two of them and both of them had frequent transmission problems. Buicks obviously break down all the time."}
{"updated_label":"faulty generalization","source_article":"Everyone is against child pornography. I asked Mrs. Smith and Mr. Jones at the PTA meeting and they are definitely against it."}
{"updated_label":"faulty generalization","source_article":"Jason said that that was all cool and everything, but his grandfather smoked, like, 30 cigarettes a day and lived until 97 - so don't believe everything you read about meta analyses of methodologically sound studies showing proven causal relationships."}
{"updated_label":"faulty generalization","source_article":"This new test seemed so promising, but the 3 studies that supported its validity turned out to have critical methodological flaws, so the test is probably not valid."}
{"updated_label":"faulty generalization","source_article":"I know for a fact that ghosts exist. My friend, who is a very reliable person, has seen ghosts on many occasions."}
{"updated_label":"faulty generalization","source_article":"Exercise is good. Therefore everybody should exercise.'\r\n\"'I agree,' said Polly earnestly. 'I mean exercise is wonderful. I mean it builds the body and everything.'"}
{"updated_label":"faulty generalization","source_article":"Everybody understands that the values in New York City are socially liberal and pro-abortion and pro-gay marriage,' he said. 'And focus on money and the media."}
{"updated_label":"faulty generalization","source_article":"I've never knowingly listened to a Neil Young record all the way through because they all sound like someone strangling a cat (don't they?)."}
{"updated_label":"faulty generalization","source_article":"French people are great at kissing. Julie is French. Get me a date!"}
{"updated_label":"faulty generalization","source_article":"Based on a survey of 1000 American homeowners, 99% of those surveyed have two or more automobiles worth on average $100,000 each.  Therefore, Americans are very wealthy."}
{"updated_label":"faulty generalization","source_article":"Four out of five dentists recommend Happy Glossy Smiley toothpaste brand.  Therefore, it must be great."}
{"updated_label":"faulty generalization","source_article":"Wife: Should we buy the house?\r\nHusband: The Realtor didn’t say anything about any problems, so I am sure it is fine. Let’s get it!\r\n"}
{"updated_label":"faulty generalization","source_article":"My mother has always told me not to drink milk after eating fish because she knows a friend whose skin got patched after drinking milk and eating fish together. Besides, many other people have told me the same thing so it must be true."}
{"updated_label":"faulty generalization","source_article":"If we use just one more can of hairspray this month, earth as we know it will no longer exist."}
{"updated_label":"faulty generalization","source_article":"Teacher: If I let you go to the bathroom pretty soon everybody will want to go to the bathroom. This is an example of"}
{"updated_label":"faulty generalization","source_article":"If you break your diet and have one cookie tonight, you will just want to eat 10 cookies tomorrow, and before you know it, you will have gained back the 15 pounds you lost."}
{"updated_label":"faulty generalization","source_article":"If you allow one student to take an online course, soon\r\neveryone will want to, and the schools will be empty."}
{"updated_label":"faulty generalization","source_article":"You should never gamble. Once you start gambling you find it hard to stop. Soon you are spending all your money on gambling, and eventually you will turn to crime to support your earnings."}
{"updated_label":"faulty generalization","source_article":"If you don't study, you'll fail your test. Then you will do poorly in the class and you GPA will fall. You won't get into a good college, so you'll never get a decent job and you'll end up poor and homeless."}
{"updated_label":"faulty generalization","source_article":"We can’t freeze the academic year because then students won’t graduate on time. Next thing you know most people will be unemployed and will resort to crime. The crime rate will skyrocket and society will collapse."}
{"updated_label":"faulty generalization","source_article":"Yesterday you were 5 minutes late, today 10, and tomorrow you won't even show up!"}
{"updated_label":"faulty generalization","source_article":"\"We've got to stop them from banning poetry. Once they start banning one form of literature, they will never stop. Next thing you know, they will be burning all the books!\" Ammar demanded."}
{"updated_label":"faulty generalization","source_article":"If we allow our 14 year-old to have her first date tonight, what's next? A wedding, kids?"}
{"updated_label":"faulty generalization","source_article":"If you don’t expose your child to germs, he will never get sick. Therefore, he will never build up his immune system to fight illness. He will grow up to be a sickly adult."}
{"updated_label":"faulty generalization","source_article":"My mother always told me that if I went outside right after bathing, during winter, I would catch pneumonia."}
{"updated_label":"faulty generalization","source_article":"Today late for ten minutes, tomorrow late for an hour, and then someday you will simply cease to show up."}
{"updated_label":"faulty generalization","source_article":"If you don't get up early every day you will be late. The more you are late the more trouble you will get into. The more trouble you get into, you will end up losing your job and your family will starve. (This is an example of...)"}
{"updated_label":"faulty generalization","source_article":"If we ban cell phones because they are bad for teenagers next the government will ban all iPods and eventually all video games as well."}
{"updated_label":"faulty generalization","source_article":"If we allow students to have cell phones, it will lead to chaos in the classroom.  If we have chaos in the classroom, the students will fail to learn.  If they fail to learn, their lives will be ruined forever!"}
{"updated_label":"faulty generalization","source_article":"Allowing overnight guests in the dorm rooms will lead to nothing but trouble: promiscuity, teen pregnancy, and eventually, a bunch of unwed mothers on campus, trying to complete their degrees while raising a child."}
{"updated_label":"faulty generalization","source_article":"The use of laptops and other devices to replace books in the classroom would eventually lead to the downfall of printing and publishing companies, causing many people to be laid off from their jobs. As such, schools should stick to using printed books as study materials."}
{"updated_label":"faulty generalization","source_article":"If you allow the students to redo this test, they are going to want to redo every assignment for the rest of the year."}
{"updated_label":"faulty generalization","source_article":"Don't let your children stay up till midnight on New Year's Eve. Before you know it, they'll be demanding to stay up till midnight every night."}
{"updated_label":"faulty generalization","source_article":"If you break your diet and have one cookie tonight, you will just want to eat 10 cookies tomorrow, and before you know it, you will have gained back the 15 pounds you lost. This is an example of which logical fallacy?"}
{"updated_label":"faulty generalization","source_article":"“If we let teenagers wear whatever they want to school, they will no longer respect the rules and academic performance will decline.”"}
{"updated_label":"faulty generalization","source_article":"If we let this child bring the permission slip late, there is no reason to ever set a deadline for anything again!"}
{"updated_label":"faulty generalization","source_article":"If we let your brother stay, we’ll have to let your whole family stay."}
{"updated_label":"faulty generalization","source_article":"If you allow the students to redo this one test, they will always want to redo all future tests"}
{"updated_label":"faulty generalization","source_article":"If we let the government implant tracking devices in criminals, it's not going to stop there! They're going to want to track us at work, our school children, and then eventually everyone!"}
{"updated_label":"faulty generalization","source_article":"\"I failed my AP vocab test so clearly I'm going to fail the class. Then I won't get into college and will never get a job. I will have to live in my parents' basement for the rest of my life. My life is ruined\" is an example of"}
{"updated_label":"faulty generalization","source_article":"If we keep kids from enjoying recess, eventually they will never want to preserve nature."}
{"updated_label":"faulty generalization","source_article":"If we allow a housing development to be built on Sunny Lake, a resort will come next, and soon we won’t have any wilderness left!"}
{"updated_label":"faulty generalization","source_article":"\"If you lie, than you will end up in jail.\" Is an example of..."}
{"updated_label":"faulty generalization","source_article":"Brad's mother asked him why he wasn't trying out for the school play. He responded: ''Because if Tom gets the male lead, which he always does, then I'll only be in the chorus, and it's not worth being in the play if I'm only going to be in the chorus.'' This is an example of which logical fallacy?"}
{"updated_label":"faulty generalization","source_article":"We have to stop the tuition increase! The next thing you know, they'll be charging $40,000 a semester!"}
{"updated_label":"faulty generalization","source_article":"If you don’t eat breakfast, you’ll slouch in your desk. If you slouch in your desk, you’ll hurt your back. If you hurt your back, you’ll never become President. What fallacy is being committed here?"}
{"updated_label":"faulty generalization","source_article":"\"We can't allow students to be paid for their grade because next thing you know they'll expect to be paid just for waking up in the morning.\""}
{"updated_label":"faulty generalization","source_article":"If we teach anton how to drive the car, he’ll want to learn how to fly helicopters next!"}
{"updated_label":"faulty generalization","source_article":"If I eat this donut today, I'll probably do it again tomorrow and the next day, and then I'll never be able to eat healthy again."}
{"updated_label":"faulty generalization","source_article":"If Mr. Stiedemann assigns us homework then I can't work on other assignments in my other classes. Then my teachers will get mad and cause me to get angry. Then my anger will lead to behavioral issues and I'll get suspended."}
{"updated_label":"faulty generalization","source_article":"\"Once you leave the house, you cannot go back. You will not receive any financial support so you need to stop going to school. Your credit card will be cut so you need to work. You will live on your own.\""}
{"updated_label":"faulty generalization","source_article":"“No! Don't eat that piece of chocolate. Today, it's one piece of chocolate, but tomorrow, you've gained 20 lbs!”"}
{"updated_label":"faulty generalization","source_article":"\"You can never give anyone a break. If you do, they'll walk all over you.\""}
{"updated_label":"faulty generalization","source_article":"Don't let your cousin borrow $10.00. Next, he's going to be borrowing money from you every day."}
{"updated_label":"faulty generalization","source_article":"If we let our child out of his room, eventually he will want to leave the house, and will end up on the street. If he is walking around on the street then he will be snatched up by a stranger and sold into slavery in a remote region on the World."}
{"updated_label":"faulty generalization","source_article":"Don't ever steal! Once you start, you won't be able to stop, and you'll end up bankrupt."}
{"updated_label":"faulty generalization","source_article":"If you eat that cookie tonight, you'll eat ten tomorrow, and by this time next year, you'll be eating 1 million cookies a day."}
{"updated_label":"faulty generalization","source_article":"If I go to the bathroom, I will miss the notes, then I'll do poorly on a test, then I won't get into college, so I won't go to the bathroom."}
{"updated_label":"faulty generalization","source_article":"\"If I raise you, I must raise everyone, and then the company goes bankrupt.\""}
{"updated_label":"faulty generalization","source_article":"If we let the government implant tracking devices in criminals, it's not going to stop there! They're going to want to track school children and eventually everyone!"}
{"updated_label":"faulty generalization","source_article":"If you're going to add that much salt to the soup, you might as well pour the whole box in!"}
{"updated_label":"faulty generalization","source_article":"If we get rid of assault weapons for citizens then we will also soon lose freedom of speech and all freedoms as other countries rush in to conquer us (if the zombies don’t exterminate us first!)"}
{"updated_label":"faulty generalization","source_article":"Don't ever gamble! Once you start, you won't be able to stop, and you'll end up bankrupt."}
{"updated_label":"faulty generalization","source_article":"If you forget to floss, you will get cavities, and if you get cavities, you will lose all your teeth by the time you're 30."}
{"updated_label":"faulty generalization","source_article":"If you don't go to camp, you won't have fun this summer, and your whole summer will be ruined!"}
{"updated_label":"faulty generalization","source_article":"If we allow euthanasia, the next thing you know, murder will be legal."}
{"updated_label":"faulty generalization","source_article":"Animal experimentation reduces our respect for life. If we don't respect life, we are likely to be more and more tolerant of violent acts like war and murder. Soon our society will become a battlefield in which everyone constantly fears for their lives. It will be the end of civilization."}
{"updated_label":"faulty generalization","source_article":"If we use one more can of hairspray this month, the ozone layer will not exist, and we will not exist!"}
{"updated_label":"faulty generalization","source_article":"You should never gamble! Once you start gambling you find it hard to stop. Soon you will spend all your money on gambling, and eventually you will turn to crime just to support your gambling addiction."}
{"updated_label":"faulty generalization","source_article":"\"If you give a mouse a cookie, he'll want a glass of milk to go with it\" is a book built around THIS fallacy."}
{"updated_label":"faulty generalization","source_article":"\"If you don't get an A in Mr. K's class you will fail high school, never graduate, and end up fighting people for nickels under freeway as a career\""}
{"updated_label":"faulty generalization","source_article":"If we let the government ban SUVs, then they're going to want to ban trucks! Then they'll want to ban sports cars! Then they'll want to ban all cars!"}
{"updated_label":"faulty generalization","source_article":"If we allow Susan to leave early, soon we'll be giving everyone Friday afternoon off."}
{"updated_label":"faulty generalization","source_article":"Major in English in college, start reading poetry, and next thing you know, you will become an unemployed pot-smoking loser."}
{"updated_label":"faulty generalization","source_article":"Never be kind and generous to the poor. They’ll come to expect your help always and never learn to contribute to society."}
{"updated_label":"faulty generalization","source_article":"One cigarette will lead youth to addiction"}
{"updated_label":"faulty generalization","source_article":"Passing federal laws to control the amount of violence in music is the first step in a process that will result in absolute government control of the media and total censorship over all forms of artistic expression."}
{"updated_label":"faulty generalization","source_article":"We've got to stop them from banning pornography. Once they start banning one form of literature, they will never stop. Next thing you know, they will be burning all the books!"}
{"updated_label":"faulty generalization","source_article":"Allowing gay marriage puts us on the way to polygamy and bestiality"}
{"updated_label":"faulty generalization","source_article":"gun registration would start us sliding into the unconstitutional morass of universal arms confiscation."}
{"updated_label":"faulty generalization","source_article":"President Obama’s decision to arm Syrian rebels, however meagerly, has all but doomed us to an Iraq-style debacle"}
{"updated_label":"faulty generalization","source_article":"Decriminalizing marijuana turns the U.S. into a stoner nation"}
{"updated_label":"faulty generalization","source_article":"sending M-16s to Syrian rebels inevitably mean boots on the ground in Damascus."}
{"updated_label":"faulty generalization","source_article":"I hope the art mural at 34th and Habersham will not be allowed. You open the gate for one, you open it for all and you'll have it all over the city. A person wanting to paint on buildings is nothing more than upscale graffiti. More than likely it will go too far."}
{"updated_label":"faulty generalization","source_article":"First we handed out I-pads, now we use Quizizz, next we'll have robot subs!"}
{"updated_label":"faulty generalization","source_article":"If we legalize marijuana, then more people will try heroin"}
{"updated_label":"faulty generalization","source_article":"His house is about half the size of most houses in the neighborhood. Therefore, his doors must all be about 3 1\/2 feet high."}
{"updated_label":"faulty generalization","source_article":"I heard that the Catholic Church was involved in a sex scandal cover-up.  Therefore, my 102-year-old Catholic neighbor, who frequently attends Church, is guilty as well!"}
{"updated_label":"faulty generalization","source_article":"\"I had a bad teacher once; therefore, all teachers must be bad.\""}
{"updated_label":"faulty generalization","source_article":"Victor, the company you work for just filed for bankruptcy! How can I trust you with our money?"}
{"updated_label":"faulty generalization","source_article":"Don't use iPhones. Teachers use iPhones and teachers are extremely dorky. If you use an iPhone, you will be dorky like a teacher!"}
{"updated_label":"faulty generalization","source_article":"\"Tyler's friends are all obnoxious, he's a bad kid,\" Which Fallacy does this statement use?"}
{"updated_label":"faulty generalization","source_article":"She has always associated with shady people, so she must not be trustworthy."}
{"updated_label":"faulty generalization","source_article":"Paige wants to play a guitar solo on our next recording. Her father is a horrible musician, though, so I doubt that Paula's any good either."}
{"updated_label":"faulty generalization","source_article":"Don't try to tell me that you only watch educational programming, Emmy! I know for a fact that your sister only watches reality television."}
{"updated_label":"faulty generalization","source_article":"Did you really vote for Donald as class treasurer? Didn't you hear that his uncle was imprisoned for embezzling $1.5 million?"}
{"updated_label":"faulty generalization","source_article":"Laura is the class president. She believes that the class should sponsor a dance as a fundraiser. Then she learns that a group of girls that she doesn't like also support the idea of a dance as a fundraiser. So, Laura changes her mind and decides that the class should plan a race instead."}
{"updated_label":"faulty generalization","source_article":"Eugene is silly in class. Harry is his friend, so Harry must be silly, too."}
{"updated_label":"faulty generalization","source_article":"\"She's definitely a feminist; she watched the Democratic National Convention\" IS an example of this fallacy."}
{"updated_label":"faulty generalization","source_article":"\"All elephants are big. Some boys are big. Therefore some boys are elephants.\""}
{"updated_label":"faulty generalization","source_article":"A person hanging out in a bar will be an alcoholic"}
{"updated_label":"faulty generalization","source_article":"Several years ago, a group of 10 psychologists started a psychology training program. Each of those psychologists is efficient, effective, and highly-regarded. Their training program must be efficient, effective, and highly-regarded."}
{"updated_label":"faulty generalization","source_article":"A car makes less pollution than a bus. Therefore, cars are less of a pollution problem than buses"}
{"updated_label":"faulty generalization","source_article":"Atoms are colorless. Cats are made of atoms, so cats are colorless"}
{"updated_label":"faulty generalization","source_article":"Your brain is made of molecules.  Molecules are not the source of consciousness.  Therefore, your brain cannot be the source of consciousness."}
{"updated_label":"faulty generalization","source_article":"Men score better on math than women do. Jerry is a man. Therefore, Jerry is better at math than Sylvia, who is a woman."}
{"updated_label":"faulty generalization","source_article":"While jogging around the neighborhood, you are more likely to get bitten by someone’s pet dog, than by any member of the canine species."}
{"updated_label":"faulty generalization","source_article":"Michael is part of the Jackson Five.  Without Tito and company, he will never make it."}
{"updated_label":"faulty generalization","source_article":"If indoor smoking laws are passed for bars, the bars will go out of business since people who drink, smoke while they drink."}
{"updated_label":"faulty generalization","source_article":"Besides charities, comfort, community cohesion, rehabilitation, and helping children learn values, religion poisons everything."}
{"updated_label":"faulty generalization","source_article":"President Petutti ordered a military strike that killed many civilians. He is no different than any other mass murder and he belongs in prison!"}
{"updated_label":"faulty generalization","source_article":"Delores is a big supporter for equal pay for equal work.  This is the same policy that all those extreme feminist groups support.  Extremists like Delores should not be taken seriously -- at least politically."}
{"updated_label":"faulty generalization","source_article":"Pol Pot, the Cambodian Maoist revolutionary, was against religion, and he was a very bad man.  Frankie is against religion; therefore, Frankie also must be a very bad man."}
{"updated_label":"faulty generalization","source_article":"This clinic sure makes a lot of money. Each of the psychologists who work there must earn a large income."}
{"updated_label":"faulty generalization","source_article":"Donald Trump Jr. Tweeted:\r\nIf I had a bowl of skittles and I told you just three would kill you. Would you take a handful? That's our Syrian refugee problem.\r\n"}
{"updated_label":"false causality","source_article":"\"Every time I go to sleep the sun goes down. Therefore, my sleeping causes the sun to set.\""}
{"updated_label":"false causality","source_article":"Since Anna Camacho became vice president of the parent-teacher association, student performance has declined and teacher morale is down. We on the school board believe that Camacho bears sole responsibility for the downtrend."}
{"updated_label":"false causality","source_article":"Children who play violent video games act more violently than those who don’t."}
{"updated_label":"false causality","source_article":"\"Everytime I wash my car it rains, therefore, washing my car makes it rain.\""}
{"updated_label":"false causality","source_article":"Joan is scratched by a cat while visiting her friend. Two days later she comes down with a fever. Joan concludes that the cat's scratch must be the cause of her illness."}
{"updated_label":"false causality","source_article":"“Eating five candy bars and drinking two sodas before a test helps me get better grades. I did that and got an A on my last test in history.”\r\nWhat fallacy is this an example of?"}
{"updated_label":"false causality","source_article":"Water fluoridation affects the brain. Citywide, student’s test scores began to drop five months after fluoridation began. The water fluoridation must have caused the student's test scores to drop."}
{"updated_label":"false causality","source_article":"The economy continues to grow as the number of \"likes\" on my Instagram account continue to increase. Clearly, the two are linked."}
{"updated_label":"false causality","source_article":"Global chocolate consumption is highest in Switzerland, yet people there are among the trimmest in the industrialized world. Therefore, it's reasonable to conclude that chocolate helps keep your weight down."}
{"updated_label":"false causality","source_article":"\"Right when I sneezed, the power went off. I must've caused the outage.\" Bragged Zohaw."}
{"updated_label":"false causality","source_article":"“President Kumail raised taxes, and then the rate of violent crime went up. Kumail is responsible for the rise in crime.”"}
{"updated_label":"false causality","source_article":"People who eat yogurt have healthy guts. If I eat yogurt I will never get sick."}
{"updated_label":"false causality","source_article":"Almadina school of Richmond does not have many students, so that must mean that the school has a very selective admissions process."}
{"updated_label":"false causality","source_article":"Every time that rooster crows, the sun comes up. That rooster must be very powerful and important!"}
{"updated_label":"false causality","source_article":"Pointing to a fancy chart, Roger shows how temperatures have been rising over the past few centuries, whilst at the same time the numbers of pirates have been decreasing; thus pirates cool the world and global warming is a hoax."}
{"updated_label":"false causality","source_article":"I'm moving to Connecticut because it is the richest state in the nation and I'm tired of being poor."}
{"updated_label":"false causality","source_article":"I wore my lucky red shirt when I took the test, so that is probably why I did so well on the test."}
{"updated_label":"false causality","source_article":"\"Because I forgot to leave my porch light on, someone robbed my house.\""}
{"updated_label":"false causality","source_article":"“I sneezed exactly at the same time the power went off. My sneeze must’ve done something to make the power go off. “"}
{"updated_label":"false causality","source_article":"I saw John texting yesterday, and then he got in his car and drove away; he must have crashed because he was texting. Therefore, cell phones should be banned."}
{"updated_label":"false causality","source_article":"Some students failed a test last week and they all had cell phones.  Having cell phones, therefore, made them fail."}
{"updated_label":"false causality","source_article":"\"The dinosaurs became extinct because they ate vegetables...\" is an example of what?"}
{"updated_label":"false causality","source_article":"A rainbow appeared in the sky the day before basketball tryouts, and I made the team! If there's a rainbow when I try out in the spring, I'm sure I'll make the team again."}
{"updated_label":"false causality","source_article":"“Yesterday, I walked under a ladder with an open umbrella indoors while spilling salt in front of a black cat. And I forgot to knock on wood with my lucky dice. That must be why I’m having such a bad day today. It’s bad luck.”"}
{"updated_label":"false causality","source_article":"Last year, the city of Brookfield allocated more money to public parks. This year, however, littering increased, so the increase in park funding must have been responsible."}
{"updated_label":"false causality","source_article":"Since Lucy Sutton became vice president of the parent-teacher association, student performance has declined and teacher morale is down. We on the school board believe that Sutton bears sole responsibility for the downtrend."}
{"updated_label":"false causality","source_article":"You oversleep and then fail a test; so you assume that oversleeping causes you to fail tests"}
{"updated_label":"false causality","source_article":"Your sister broke her arm, and then you broke your nose. So you assume that a sibling breaking a bone causes you to break one too."}
{"updated_label":"false causality","source_article":"My grandmother ate 10 cloves of raw garlic every day. Not surprisingly she lived to be 102."}
{"updated_label":"false causality","source_article":"Tommy went to go swimming for the afternoon and later bought a lottery ticket. He won the lottery which must mean that swimming makes you win the lottery."}
{"updated_label":"false causality","source_article":"Alley ate a slice of pizza for dinner and a few hours later she had a fever. Therefore, pizza causes fevers."}
{"updated_label":"false causality","source_article":"1. “Michael Jordan wore his UNC shorts during every game he played in the NBA and he won 6 championships.”"}
{"updated_label":"false causality","source_article":"“The economy has improved greatly because of the new president.”"}
{"updated_label":"false causality","source_article":"Kevin's dog scratched his leg, and that night he had a fever. Kevin concluded that his dog must have infected him with something."}
{"updated_label":"false causality","source_article":"Our soccer team was losing until I bought new shoes. We have not lost a game since I got my lucky shoes!"}
{"updated_label":"false causality","source_article":"The temperature has dropped this morning, and I also have a headache. The cold weather must be causing my headache."}
{"updated_label":"false causality","source_article":"\"Why are you hitting your computer!?\"\r\n\"The last time my wifi was weak, I hit my computer and it got better.\" What is this?"}
{"updated_label":"false causality","source_article":"She took a drink from the drinking fountain yesterday and now she's sick. It must have been the public fountain that made her sick."}
{"updated_label":"false causality","source_article":"I broke a mirror earlier in the day, and then I received an F on my history final. Therefore, I received the F because I broke the mirror."}
{"updated_label":"false causality","source_article":"Our house was burglarized right after that new family moved in next door. Therefore, that new family must have been involved."}
{"updated_label":"false causality","source_article":"Every day, I eat cereal for breakfast. One time, I had a muffin instead, and there was a major earthquake in my city. I've eaten cereal ever since."}
{"updated_label":"false causality","source_article":"\"I drank bottled water and now I am sick, so the water must have made me sick.\""}
{"updated_label":"false causality","source_article":"If the President arrives in Hawaii, and the next day a volcano erupts, believing that the volcano erupted because the President arrived on the island is an example of:"}
{"updated_label":"false causality","source_article":"Every time that rooster crows, the sun comes up. The rooster must control the sun."}
{"updated_label":"false causality","source_article":"I failed Pre-Cal because my teacher doesn’t like me."}
{"updated_label":"false causality","source_article":"Texting has killed people’s ability to write in complete sentences with proper grammar."}
{"updated_label":"false causality","source_article":"Water fluoridation affects the brain. Citywide, student’s test scores began to drop five months after fluoridation began."}
{"updated_label":"false causality","source_article":"\"I started exercising twice a week, and I just got a babysitting job. Exercising leads to new jobs!\""}
{"updated_label":"false causality","source_article":"Since Samantha got that new apron, she hasn't burned any cookies. That new apron sure does help her cooking!"}
{"updated_label":"false causality","source_article":"The party was going great! Then Gerald showed up and little by little people started collecting their coats and heading home. Gerald ruined the party."}
{"updated_label":"false causality","source_article":"My brother received the COVID-19 vaccine and then had diarrhea for a week. The vaccine is the reason my brother's bowels came undone."}
{"updated_label":"false causality","source_article":"When the new administration came on campus, test scores increased and attendance improved."}
{"updated_label":"false causality","source_article":"If the country is ever going to be safe from terrorists we have to close the borders."}
{"updated_label":"false causality","source_article":"\"You're not feeling well because you use your phone so much.\""}
{"updated_label":"false causality","source_article":"I took a vitamin this morning and now I’m sick, so the vitamin must have made me ill."}
{"updated_label":"false causality","source_article":"\"In March, 5G was introduced and then we all got COVID\" is an example of"}
{"updated_label":"false causality","source_article":"\"It rained and we lost the game. Every time it rains, we are going to lose.\""}
{"updated_label":"false causality","source_article":"Farmer McDonald: Ever since they put up that new power plant across the river, we haven't had a bit of rain. I'm tellin' you, mankind has got too big for its britches when it fiddles around with nature."}
{"updated_label":"false causality","source_article":"“President Jones raised taxes, and then the rate of violent crime went up. Jones is responsible for the rise in crime.\""}
{"updated_label":"false causality","source_article":"I ate Oreos, and then I was sick the next day. It must have been the Oreos that caused my sickness."}
{"updated_label":"false causality","source_article":"\"Every time I forget my lunch bag, school ends early\" is an example of"}
{"updated_label":"false causality","source_article":"\"Every time my sister uses hairspray, it is an extremely hot day\" is an example of"}
{"updated_label":"false causality","source_article":"Joey's refrigerator broke after Rachel moved in; therefore, Rachel caused Joey's refrigerator to break."}
{"updated_label":"false causality","source_article":"You cannot blame your friends for a rain delay just because every time they go with you to a ballgame it storms and\r\nplay is delayed. Likewise, the fact that a pitcher bought new socks before he pitched a winning game does not mean that new\r\nsocks cause a pitcher to throw faster."}
{"updated_label":"false causality","source_article":"Cellphones weren’t invented before I was born. Now, they are everywhere! Therefore, cellphones were created because I was born."}
{"updated_label":"false causality","source_article":"I passed my math test after going out to the movies the night before. I should go to the movies the night before every math test!"}
{"updated_label":"false causality","source_article":"Every girl I've dated has been a nurse. I must only be compatible with nurses!"}
{"updated_label":"false causality","source_article":"\"A baseball pitcher bought new socks before he pitched a winning game. The new socks caused a pitcher to throw faster! He will wear the new socks for EVERY game now.\"\r\n\r\nThis is an example of..."}
{"updated_label":"false causality","source_article":"\"I drank bottled water and now I am sick, so the water must have made me sick.\"\r\n\r\nWhat logical fallacy is used in the statement above?"}
{"updated_label":"false causality","source_article":"You got a cold two nights ago but last night you stayed up really late and now you are no longer sick, so it must be because you stayed up really late last night. What fallacy is being committed?"}
{"updated_label":"false causality","source_article":"The flu vaccine comes out every year just before the holidays, then people go and spend a lot of money. Therefore, businesses are secretly using the flu vaccine as a mind control device to increase holiday spending."}
{"updated_label":"false causality","source_article":"I broke my mirror this morning, AND I failed my Civics test. I must've failed because the mirror gave me bad luck."}
{"updated_label":"false causality","source_article":"\"It rained and then we lost the game. Every time it rains, we're going to lose.\""}
{"updated_label":"false causality","source_article":"Eating five candy bars and drinking two sodas before a test helps me get better grades. I did that and got an A on my last test in history."}
{"updated_label":"false causality","source_article":"Lois and Jan did a \"snow dance\" one afternoon, and it snowed that night. They claimed to have brought the snow."}
{"updated_label":"false causality","source_article":"I sneezed at the same time the power went off. My sneeze did something to make the power go off."}
{"updated_label":"false causality","source_article":"I bought new shoes then my head started itching. I must be allergic to the shoes."}
{"updated_label":"false causality","source_article":"There was a thunderstorm with rain therefore I did not finish my homework."}
{"updated_label":"false causality","source_article":"Fatima sneezed and she caused a tsunami in Tokyo."}
{"updated_label":"false causality","source_article":"Jack threw up because he ate Hot Cheetos."}
{"updated_label":"false causality","source_article":"I broke my mirror this morning, AND I failed my History test. I must've failed because the mirror gave me bad luck."}
{"updated_label":"false causality","source_article":"You know Jane Fonda’s exercise video’s must be worth the money. Look at the great shape she’s in."}
{"updated_label":"false causality","source_article":"\"Truly helps cramming for a test: my psychological test is crowded and I have an A.\""}
{"updated_label":"false causality","source_article":"During the first week of July ice cream sales climbed, and during the second week murder rates climbed. Therefore, ice cream inspires murder."}
{"updated_label":"false causality","source_article":"One day, Megan wore a Donald Duck t-shirt, and she got an ¨A¨ on her Chemistry test. Now she wears a Donald Duck t-shirt every day to Chemistry class. \r\nOf what fallacy is this an example?"}
{"updated_label":"false causality","source_article":"“President Jones raised taxes, and then the rate of violent crime went up. Therefore, I think Jones is responsible for the rise in crime.\""}
{"updated_label":"false causality","source_article":"Fewer tourists were recorded to have entered the country. This datum was gathered after Karapatan exposed the human rights violations happening here; therefore, Karapatan's expose was the reason for the low tourist turn out."}
{"updated_label":"false causality","source_article":"President Jones raised taxes, and then the rate of violent crime went up. Jones is responsible for the rise in crime."}
{"updated_label":"false causality","source_article":"Every severe recession follows a Republican Presidency; therefore Republicans are the cause of recessions."}
{"updated_label":"false causality","source_article":"Matthieu was the only player on the team who didn't grow a playoff beard, and thus he ended up getting injured."}
{"updated_label":"false causality","source_article":"I dropped the ball because Mercury is in retrograde."}
{"updated_label":"false causality","source_article":"The Soviet Union collapsed after taking up atheism. Therefore, we must avoid atheism for the same reasons."}
{"updated_label":"false causality","source_article":"Families communicate less and less in the past forty years since feminism became mainstream. Feminism is to blame for this deterioration in the family."}
{"updated_label":"false causality","source_article":"\"A solar flare erupted from the sun three days ago, and my laptop died this morning. Solar flares are very dangerous for computers.\""}
{"updated_label":"false causality","source_article":"Valencia bought a different brand of detergent at the store. She developed a rash after wearing clothes washed in the new detergent. She concluded that she was allergic to the new soap. What type of reasoning is this?"}
{"updated_label":"false causality","source_article":"Giving 10% of your income to the Church will free a child’s soul from Limbo into Heaven, so give your money!"}
{"updated_label":"false causality","source_article":"Shortly after MySpace became popular, U.S. soldiers found Saddam Hussein."}
{"updated_label":"false causality","source_article":"Michael Jackson, Kurt Cobain, and Jimi Hendrix were rock stars who died young. Therefore, if you become a rock star, don’t expect to live a long life."}
{"updated_label":"false causality","source_article":"Dan White ate a lot of Twinkies and then killed the Mayor of San Francisco. If I were a mayor, I’d ban Twinkies so no one would kill me."}
{"updated_label":"false causality","source_article":"There are more laws on the books than ever before, and more crimes are being committed than ever before. Therefore, to reduce crime, we must eliminate the laws."}
{"updated_label":"false causality","source_article":"Since your parents named you ‘Harvest,’ they must be farmers."}
{"updated_label":"false causality","source_article":"very time Joe goes swimming he is wearing his Speedos. Something about wearing that Speedo must make him want to go swimming."}
{"updated_label":"false causality","source_article":"Someone really should move this ‘deer crossing’ sign. This is a dangerous stretch of highway and the deer really should be crossing somewhere else."}
{"updated_label":"false causality","source_article":"Jimmy has a fever, sinus congestion, a cough, and can’t come to school, so he probably has a test later today."}
{"updated_label":"false causality","source_article":"Jimmy isn’t at school today. He must be on a family trip."}
{"updated_label":"false causality","source_article":"Our garage sale made lots of money before Joan showed up. Obviously, she scared off all the customers."}
{"updated_label":"false causality","source_article":"Students are poor writers because they watch too much TV"}
{"updated_label":"false causality","source_article":"The picture on Jim's old TV set goes out of focus. Jim goes over and strikes the TV soundly on the side and the picture goes back into focus. Jim tells his friend that hitting the TV fixed it."}
{"updated_label":"false causality","source_article":"It was observed that persons who went out at night often developed the malady. So night air was assumed to be the cause of malaria, and elaborate precautions were taken to shut it out of sleeping quarters"}
{"updated_label":"false causality","source_article":"My new way of obtaining informed consent helps prevent dropouts. I chose the three therapists in our clinic who had the highest dropout rates and taught them my new informed consent procedure. The first month that they started using it, all three had significantly lower dropout rates."}
{"updated_label":"false causality","source_article":"Joe eats horribly; therefore, his heart attack was caused by his eating habits."}
{"updated_label":"false causality","source_article":"Before women got the vote, there were no nuclear weapons"}
{"updated_label":"false causality","source_article":"Every time my brother Bill accompanies me to Fenway Park, the Red Sox are sure to lose"}
{"updated_label":"false causality","source_article":"When sales of hot chocolate go up, street crime drops."}
{"updated_label":"false causality","source_article":"earthquakes in the Andes were correlated with the closest approaches of the planet Uranus. Therefore, Uranus must have caused them."}
{"updated_label":"false causality","source_article":"The bigger a child's shoe size, the better the child's handwriting"}
{"updated_label":"false causality","source_article":"The accident was caused by the taxi parking in the street"}
{"updated_label":"false causality","source_article":"Mom: Watching TV that close will make you go blind, so move back!\r\nJonny: That is B.S., Mom. Sorry, I am not moving.\r\n"}
{"updated_label":"false causality","source_article":"The Church used to claim that giving 10% of your income to the Church will free a child’s soul from Limbo into Heaven, so clearly giving money to the Church is a scam!"}
{"updated_label":"false causality","source_article":" \r\nThe presence of police at protests cause an escalation of violence. It was the case that at the protest last night attended by uniformed police, there was an escalation of violence. Therefore, police should not be at protests."}
{"updated_label":"false causality","source_article":"Billy murdered all those people because I spanked him when he was a child."}
{"updated_label":"false causality","source_article":"The reason Donald Trump got elected was because liberals took political correctness too far."}
{"updated_label":"false causality","source_article":"P1. Lead poisoning can contribute to violent behavior.\r\nP2. Many inner city children have dangerous levels of lead in their blood.\r\nC. Therefore, violent crime in the inner city can be solved by curing the lead problem."}
{"updated_label":"false causality","source_article":"P1. A sedentary lifestyle contributes to obesity.\r\nP2. People have become more sedentary in the last few decades.\r\nC. Therefore, the rise in obesity can be fixed by people getting more exercise."}
{"updated_label":"false causality","source_article":"P1. Smoking has been empirically proven to cause lung cancer.\r\nC. Therefore, if we eradicate smoking, we will eradicate lung cancer."}
{"updated_label":"false causality","source_article":" Tony: I bought a book on the law of attraction and two days later I won $30k in a lottery. I wasn’t a believer of the law of attraction before, but now I am!\r\n"}
{"updated_label":"false causality","source_article":"Many homosexuals have AIDS. Therefore, homosexuality causes AIDS."}
{"updated_label":"false causality","source_article":"“The temperature has dropped this morning, and I also have a headache. Therefore, the cold weather must be causing my headache. “"}
{"updated_label":"false causality","source_article":"The time that children are vaccinated and the time they're diagnosed do closely correlate, however, leading upset parents to assign blame to the immunizations, for lack of a better explanation. "}
{"updated_label":"false causality","source_article":"I had a real bad headache, then saw my doctor.  Just by talking with him, my headache started to subside, and I was all better the next day.  It was well worth the $200 visit fee."}
{"updated_label":"false causality","source_article":"After surgery, my wife was not doing too well -- she was in a lot of pain.  I bought these magnetic wristbands that align with the body's natural vibrations to reduce the pain, and sure enough, a few days later the pain subsided!  Thank you magic wristbands!"}
{"updated_label":"false causality","source_article":"This coin has landed heads-up nine times in a row. So it will probably land tails-up next time it is tossed."}
{"updated_label":"false causality","source_article":"Red had come up six times in a row on the roulette wheel, so Greg knew that it was close to certain that black would be next up. Suffering an economic form of natural selection with this thinking, he soon lost all of his savings."}
{"updated_label":"false causality","source_article":"I have flipped heads five times in a row.  As a result, the next flip will probably be tails."}
{"updated_label":"false causality","source_article":"Maury: Please put all my chips on red 21.\r\nDealer: Are you sure you want to do that?  Red 21 just came up in the last spin.\r\nMaury:  I didn’t know that!  Thank you!  Put it on black 15 instead.  I can’t believe I almost made that mistake!\r\n"}
{"updated_label":"false causality","source_article":"Mr. Governor issues a proclamation for the people of his state to pray for rain.  Several months later, it rains.  Praise the gods!"}
{"updated_label":"false causality","source_article":"I refuse to stay on the 13th floor of any hotel because it is bad luck.  However, I don’t mind staying on the same floor as long as we call it the 14th floor."}
{"updated_label":"false causality","source_article":"I knew I should have helped that old lady across the road.  Because I didn’t, I have been having bad Karma all day."}
{"updated_label":"false causality","source_article":"\"If a black cat crosses your path you will have bad luck.\""}
{"updated_label":"circular reasoning","source_article":"America is the best place to live, because it's better than any other country."}
{"updated_label":"circular reasoning","source_article":"The news is fake because so much of the news is fake."}
{"updated_label":"circular reasoning","source_article":"\"The Cardinals are the best football team because they're better than all the other teams.\""}
{"updated_label":"circular reasoning","source_article":"Quinoa is a delicious, plant-based source of protein because it tastes so darn good."}
{"updated_label":"circular reasoning","source_article":"God exists. How do you know? Because it says so in the Bible."}
{"updated_label":"circular reasoning","source_article":"She is good at writing because she writes words effectively.\""}
{"updated_label":"circular reasoning","source_article":"President Reagan was a great communicator because he had the knack of talking effectively to the people."}
{"updated_label":"circular reasoning","source_article":"Plagiarism is deceitful because it is dishonest."}
{"updated_label":"circular reasoning","source_article":"Canada is the best country to live in because it's better than the other countries!"}
{"updated_label":"circular reasoning","source_article":"The thing about the new math teacher (who is an excellent teacher) is that he\/she really stands out because he\/she has good teaching skills."}
{"updated_label":"circular reasoning","source_article":"Witchcraft remains our most urgent spiritual problem because it threatens\r\nour very souls."}
{"updated_label":"circular reasoning","source_article":"The witchcraft problem is the most urgent spiritual crisis in the world today. Why? Because witches threaten our very souls."}
{"updated_label":"circular reasoning","source_article":"The word of Zorbo the Great is flawless and perfect. We know this because it says so in The Great and Infallible Book of Zorbo’s Best and Most Truest Things that are Definitely True and Should Not Ever Be Questioned."}
{"updated_label":"circular reasoning","source_article":"Cell phones stop students from concentrating in class because they are distracting."}
{"updated_label":"circular reasoning","source_article":"Fast food is bad for you because is junk."}
{"updated_label":"circular reasoning","source_article":"\"Ghosts exist.... because I saw a ghost in my closet,\" is an example of what logical fallacy?"}
{"updated_label":"circular reasoning","source_article":"How do I know that Beth is the most intelligent person in our geometry class? I know because she's so smart."}
{"updated_label":"circular reasoning","source_article":"President Bennett is an effective communicator, because he has a natural talent for speaking with people.\r\nagainst"}
{"updated_label":"circular reasoning","source_article":"Pamela never lies. She told me herself, so it must be true."}
{"updated_label":"circular reasoning","source_article":"Thanks to her enduring popularity with employees, Ella Watson is the best-liked CEO in our company's history."}
{"updated_label":"circular reasoning","source_article":"“Harold’s new book is well-written because Harold is a wonderful writer.”"}
{"updated_label":"circular reasoning","source_article":"Senator Randall isn't lying when she says she cares about her constituents—she wouldn't lie to people she cares about."}
{"updated_label":"circular reasoning","source_article":"Free speech is good not just for the individual, but for all of society. After all, it's in the interest of the community that everyone should be at liberty to express his or her beliefs."}
{"updated_label":"circular reasoning","source_article":"Companies that make huge profits must be exploiting their customers because the only way a company could make large profits is by taking advantage of their customers."}
{"updated_label":"circular reasoning","source_article":"You must obey the law, because it’s illegal to break the law."}
{"updated_label":"circular reasoning","source_article":"You have to invite Jenna to your party because it would not be nice not to invite Jenna."}
{"updated_label":"circular reasoning","source_article":"1. “iPhones are the best smartphones on the market because Apple makes the best smartphones.”"}
{"updated_label":"circular reasoning","source_article":"“I know that what I experience is real because I can see, hear, smell, touch and taste everything.”"}
{"updated_label":"circular reasoning","source_article":"\"I am a great leader because I make great leadership decisions. The proof that I make great leadership decisions is that I am a great leader, and that's what leaders do.\" What is this?"}
{"updated_label":"circular reasoning","source_article":"That restaurant is popular because everyone in town goes there."}
{"updated_label":"circular reasoning","source_article":"You can't give me a C! I'm an A student, a C is just wrong!"}
{"updated_label":"circular reasoning","source_article":"You must obey the law, because it's illegal to break the law."}
{"updated_label":"circular reasoning","source_article":"Violent video games cause teens to be violent, because violent teens play violent video games."}
{"updated_label":"circular reasoning","source_article":"\"I have a right to free speech so I can say what I want and you shouldn't try to stop me. \""}
{"updated_label":"circular reasoning","source_article":"John Green is a wonderful writer because he writes so well."}
{"updated_label":"circular reasoning","source_article":"Why should we put people on trial when we know they are guilty?"}
{"updated_label":"circular reasoning","source_article":"Sleeping until noon is the worst thing to do because it is bad to sleep late."}
{"updated_label":"circular reasoning","source_article":"\"The Philippines is in poverty because of poor people.\""}
{"updated_label":"circular reasoning","source_article":"Order is necessary to justice because justice can only be achieved by a program of social and legal order."}
{"updated_label":"circular reasoning","source_article":"the reason why more people are leaving this country is because of economic problems, therefore because there is an economic problem is that people are leaving this country."}
{"updated_label":"circular reasoning","source_article":"President Reagan was a great communicator because he had the gift of talking effectively to the people."}
{"updated_label":"circular reasoning","source_article":"Taco is the best because it tastes better."}
{"updated_label":"circular reasoning","source_article":"\"I shouldn't have flunked the test because I never get F's\" is an example of"}
{"updated_label":"circular reasoning","source_article":"Americans should give money to charity because it is the right thing to do."}
{"updated_label":"circular reasoning","source_article":"We know he’s not lying since he says he’s telling the truth."}
{"updated_label":"circular reasoning","source_article":"Pvt. Joe Bowers: What are these electrolytes? Do you even know?\r\nSecretary of State: They're... what they use to make Brawndo!\r\nPvt. Joe Bowers: But why do they use them to make Brawndo?\r\nSecretary of Defense: [raises hand after a pause] Because Brawndo's got electrolytes."}
{"updated_label":"circular reasoning","source_article":"Bob: that movie was a waste of time and money\r\nTed: what was wrong with it?\r\nBob: It sucked\r\n\r\nThis is an example of?"}
{"updated_label":"circular reasoning","source_article":"\"All eighteen-year-olds have the right to vote because it's legal for them to vote.\""}
{"updated_label":"circular reasoning","source_article":"Global warming doesn’t exist because the earth is not getting warmer"}
{"updated_label":"circular reasoning","source_article":"The greatest thing that we can do is to love each other. Love is better than any other emotion."}
{"updated_label":"circular reasoning","source_article":"I am athletic because I run, and I run because I'm athletic."}
{"updated_label":"circular reasoning","source_article":"“We must accept the traditions of the men of old time who affirm themselves to be the offspring of the gods - that is what they say - and they must surely have known their own ancestors. How can we doubt the word of the children of the gods?” - Plato, Timaeus"}
{"updated_label":"circular reasoning","source_article":"Paranormal activity is real because I have experienced what can only be described as paranormal activity."}
{"updated_label":"circular reasoning","source_article":"I hated the movie because it was the worst movie I ever saw."}
{"updated_label":"circular reasoning","source_article":"This has to work so it will work."}
{"updated_label":"circular reasoning","source_article":"Paranormal activity is real because I've seen a ghost."}
{"updated_label":"circular reasoning","source_article":"Politician Running for Public Office: You can all trust what I say. I have never lied in my life."}
{"updated_label":"circular reasoning","source_article":"God did not create the world six thousand years ago because matter has always existed, and therefore the world has always existed."}
{"updated_label":"circular reasoning","source_article":"Whatever is less dense than water will float, because such objects won't sink in water."}
{"updated_label":"circular reasoning","source_article":"\"He's the best teacher I've ever had because he's the best teacher I've known.\""}
{"updated_label":"circular reasoning","source_article":"\"She is the best candidate for president because she is better than the other candidates!\""}
{"updated_label":"circular reasoning","source_article":"Andanar is unfit for the position because he seems unqualified for it."}
{"updated_label":"circular reasoning","source_article":"Sandra tells her mom, \"I deserve to have a later curfew, so you should let me stay out until 10pm!\""}
{"updated_label":"circular reasoning","source_article":"\"The BP Oil rig exploded causing many marine mammals to die.\" This illustrates that the BP oil rig was bad and caused animals to die."}
{"updated_label":"circular reasoning","source_article":"Richardson is the most successful mayor the town has ever had because he's the best mayor of our history."}
{"updated_label":"circular reasoning","source_article":"We know the virus started in a lab because it's too deadly to have just been the result of basic circumstance. But it hasn't been as deadly for China which proves that it's lab-made. Because it's deadly."}
{"updated_label":"circular reasoning","source_article":"Shakira is the best singer in the world because she is the most talented singer there is."}
{"updated_label":"circular reasoning","source_article":"\"Standardized dress should be used in schools because kids should wear standardized dress.\""}
{"updated_label":"circular reasoning","source_article":"The Bible is the Word of God because God tells us it is... in the Bible.\r\n\r\nX is true because of Y.\r\nY is true because of X."}
{"updated_label":"circular reasoning","source_article":"Students should not be allowed to park in lots now reserved for faculty because those lots should be for faculty only."}
{"updated_label":"circular reasoning","source_article":"Everybody loves Raymond because he is so popular. Popular people are loved by everybody."}
{"updated_label":"circular reasoning","source_article":"\"The Cardinals are the best football team because they're better than all the other teams. They're better than all the other teams because they're the best.\""}
{"updated_label":"circular reasoning","source_article":"\"J.K Rowling is a wonderful writer because she writes so well\" is an example of what?"}
{"updated_label":"circular reasoning","source_article":"The president of Honduras is a good leader because he is a leader of the country. This is an example of which common fallacy?"}
{"updated_label":"circular reasoning","source_article":"\"Running a marathon is very tiring because it is so exhausting.\""}
{"updated_label":"circular reasoning","source_article":"“Honesty is defined as always being honest.”"}
{"updated_label":"circular reasoning","source_article":"marijuana shouldn’t be legalized because it wasn’t socially acceptable."}
{"updated_label":"circular reasoning","source_article":"Smoking pot is against the law because it is wrong; I know it is wrong because it is against the law"}
{"updated_label":"circular reasoning","source_article":"George Bush is a good communicator because he speaks effectively."}
{"updated_label":"circular reasoning","source_article":"There aren't enough parking spaces on campus because there are too many cars."}
{"updated_label":"circular reasoning","source_article":"My new method of conducting meta-analyses is the most valid there is because it is the only one capable of such validity, the only one that has ever approached such validity, and the only one that is so completely valid."}
{"updated_label":"circular reasoning","source_article":"Being overweight leads to a shortened lifespan because it's unhealthy."}
{"updated_label":"circular reasoning","source_article":"We know God exists because he made everything"}
{"updated_label":"circular reasoning","source_article":"Interviewer: \"Your resume looks impressive but I need another reference.\"\r\nBill: \"Jill can give me a good reference.\"\r\nInterviewer: \"Good. But how do I know that Jill is trustworthy?\"\r\nBill: \"Certainly. I can vouch for her.\""}
{"updated_label":"circular reasoning","source_article":"You should drive on the right side of the road because that is what the law says, and the law is the law."}
{"updated_label":"circular reasoning","source_article":"Affirmative Action can never be fair or just. You cannot remedy one injustice by committing another."}
{"updated_label":"circular reasoning","source_article":"It says in the Bible that God exists. Since the Bible is God's word, and God never speaks falsely, then everything in the Bible must be true. So, God must exist."}
{"updated_label":"circular reasoning","source_article":"The Bible is true because God exists, and God exists because the Bible says so."}
{"updated_label":"circular reasoning","source_article":"The universe has a beginning. Every thing that has a beginning has a cause. Therefore, the universe has a cause called God."}
{"updated_label":"circular reasoning","source_article":"We know God exists because we can see the perfect order of His Creation, an order which demonstrates supernatural intelligence in its design."}
{"updated_label":"circular reasoning","source_article":"Executions are moral because we must have a death penalty to discourage violent crime."}
{"updated_label":"circular reasoning","source_article":"My way of responding to difficult patients is by far the most ethical because no other way is so ethical and it is the only way that is completely ethical."}
{"updated_label":"circular reasoning","source_article":"smoking cigarettes is deadly because cigarettes can kill you"}
{"updated_label":"circular reasoning","source_article":"The reason everyone wants the new \"Slap Me Silly Elmo\" doll is because this is the hottest toy of the season!"}
{"updated_label":"circular reasoning","source_article":"The Bible is the Word of God because God tells us it is... in the Bible."}
{"updated_label":"circular reasoning","source_article":"Tik Tok is popular among teens because so many of them use it."}
{"updated_label":"circular reasoning","source_article":"Mr. Casal was very tired because he had no energy."}
{"updated_label":"circular reasoning","source_article":"Nike's are great because they're awesome."}
{"updated_label":"circular reasoning","source_article":"I lost my phone in the living room, so it will always be in the living room when it is lost."}
{"updated_label":"circular reasoning","source_article":"My phone charger is broken because it doesn't work."}
{"updated_label":"circular reasoning","source_article":"Bert: How do eyes project an image to your brain?\r\nErnie: Think of it as a little guy in your brain watching the movie projected by your eyes.\r\nBert: Ok, but what is happening in the little guy in your head’s brain?\r\nErnie: Well, think of it as a little guy in his brain watching a movie...\r\n"}
{"updated_label":"circular reasoning","source_article":"Dicky: So how do you think life began?\r\nRalphie: Simple.  Aliens from another planet seeded this planet with life billions of years ago.\r\nDicky: OK, but how did that alien life form begin?\r\nRalphie: Simple.  Aliens from another planet seeded that planet with life.\r\n"}
{"updated_label":"fallacy of logic","source_article":"\"The mind is like a knife, cutting through difficult problems. But just as too much cutting dulls a knife, so too much education dulls the mind.\""}
{"updated_label":"fallacy of logic","source_article":"Sandra is an angel from heaven. She gave me a free lunch today."}
{"updated_label":"fallacy of logic","source_article":"What is wrong with Tanya? She only has five hundred dollars saved and she’s going away to college next year. That would be like letting my four-year-old brother go to Russia by hisself."}
{"updated_label":"fallacy of logic","source_article":"If we can send a woman into outerspace and communicate with them while they are there, then surely we can learn to communicate with one another in our state."}
{"updated_label":"fallacy of logic","source_article":"Kids: If you wouldn't eat your dog, why eat a turkey? Go vegan."}
{"updated_label":"fallacy of logic","source_article":"If I say that a surgeon should be allowed to use a guidebook to carry out surgery like a student can use open notes on a test, I have made a"}
{"updated_label":"fallacy of logic","source_article":"It is ridiculous to have spent thousands of dollars to rescue those two whales trapped in the Arctic ice. Why, look at all the people trapped in jobs they don’t like."}
{"updated_label":"fallacy of logic","source_article":"The book \"Investing for Dummies\" really helped me understand my finances better. The book \"Chess for Dummies\" was written by the same author, was published by the same press, and costs about the same amount, so it would probably help me understand my finances as well."}
{"updated_label":"fallacy of logic","source_article":"Not believing in the Tooth Fairy is like denying that the Titanic sank because eye-witnesses did not agree if the ship broke in half before or after it sank."}
{"updated_label":"fallacy of logic","source_article":"Santa has a red suit. My dad has a red suit. My dad must be Santa Claus! (This is an example of...)"}
{"updated_label":"fallacy of logic","source_article":"We shouldn't let teenagers keep their phones just because they're upset at losing them; most babies cry when you take their toys away too."}
{"updated_label":"fallacy of logic","source_article":"\"Just like students are given a couple of weeks of preparation before taking exams, doctors should also be given few days or weeks to prepare themselves before an operation or surgery, after all surgery is not as easy task\"\r\nIs an example of...."}
{"updated_label":"fallacy of logic","source_article":"Schools are like families; therefore teachers (like parents) should be allowed to discipline their students."}
{"updated_label":"fallacy of logic","source_article":"\"Cars cause more deaths than firearms do, so if we ban firearms we should also ban cars.\""}
{"updated_label":"fallacy of logic","source_article":"Asking students to sit in the same class for 2 hours is like asking them to wander the desert alone, with no water, for a week."}
{"updated_label":"fallacy of logic","source_article":"\"You passed everyone in the class, so I should get extra credit\" is an example of"}
{"updated_label":"fallacy of logic","source_article":"\"Politicians and diapers must be changed often, and for the same reason.\""}
{"updated_label":"fallacy of logic","source_article":"Not tipping your waiter is like stealing money right out of someone's wallet."}
{"updated_label":"fallacy of logic","source_article":"Since a single human cell becomes a grown man over a period of a few years, then surely it can't be impossible for a single-cell organism to become the human race over a period of several million years."}
{"updated_label":"fallacy of logic","source_article":"A cloud is 90 percent water; a watermelon is 90 percent water. Therefore, since a plane can fly through a cloud, a plane can fly through a watermelon."}
{"updated_label":"fallacy of logic","source_article":"Smoking cigarettes is just like ingesting arsenic into your system; both have been shown to be causally related to death. If you wouldn't want to take a spoonful of arsenic, I would think that you wouldn't want to continue smoking."}
{"updated_label":"fallacy of logic","source_article":"Julie was trying to demonstrate to the audience of her speech that gender inequality is like ordering fast food. \"It's not good for us,\" she said, \"but we do it all the time and men tend to go out for a burger and fries more than women do.\"\r\nWhat fallacy is this?"}
{"updated_label":"fallacy of logic","source_article":"Employees are like nails. Just as nails must be hit in the head in order to make them work, so must employees."}
{"updated_label":"fallacy of logic","source_article":"People who buy stocks are no different from people who bet on horse racing. They both risk their money with little chance of making a big profit."}
{"updated_label":"fallacy of logic","source_article":"Covid-19 is like 10 people doing arts and crafts together and one of them is working with glitter. How many art projects in the group get glitter on them?"}
{"updated_label":"fallacy of logic","source_article":"People are like dogs. They respond best to clear discipline."}
{"updated_label":"fallacy of logic","source_article":"Guns are like hammers--they're both tools with metal parts that could be used to kill someone. And yet it would be ridiculous to restrict the purchase of hammers--so restrictions on purchasing guns are equally ridiculous."}
{"updated_label":"fallacy of logic","source_article":"Medical Student: \"No one objects to a physician looking up a difficult case in medical books. Why, then, shouldn't students taking a difficult examination be permitted to use their textbooks?\""}
{"updated_label":"fallacy of logic","source_article":"People who have to have a cup of coffee every morning before they can function have no less a problem than alcoholics who have to have their alcohol each day to sustain them."}
{"updated_label":"fallacy of logic","source_article":"Doctors refer to medical books all the time when they are treating patients. In the same way, I should be allowed to use a textbook in my medical exam."}
{"updated_label":"fallacy of logic","source_article":"Hybrid cars are like solar power, full of promise but too expensive. We’ll never be able to build affordable hybrid cars."}
{"updated_label":"fallacy of logic","source_article":"If the state can require car seats for small children and infants, they can just as easily require mothers to breast-feed instead of using formula."}
{"updated_label":"fallacy of logic","source_article":"Allowing people to possess guns is like giving a bomb to a bunch of kids."}
{"updated_label":"fallacy of logic","source_article":"There were wonderful psychologists who passed away several decades ago. If they could be effective in what they did without reading any of the studies or other articles that have been published in the last several decades, there's no need for me to read any of those works in order to be effective."}
{"updated_label":"fallacy of logic","source_article":"There are seven windows given to animals in the domicile of the head: two nostrils, two eyes, two ears, and a mouth...From this and many other similarities in Nature, too tedious to enumerate, we gather that the number of planets must necessarily be seven."}
{"updated_label":"fallacy of logic","source_article":"Believing in the literal resurrection of Jesus is like believing in the literal existence of zombies."}
{"updated_label":"fallacy of logic","source_article":"The solar system reminds me of an atom, with planets orbiting the sun like electrons orbiting the nucleus. We know that electrons can jump from orbit to orbit; so we must look to ancient records for sightings of planets jumping from orbit to orbit also."}
{"updated_label":"fallacy of logic","source_article":"Minds, like rivers, can be broad. The broader the river, the shallower it is. Therefore, the broader the mind, the shallower it is."}
{"updated_label":"fallacy of logic","source_article":"We have pure food and drug laws; why can't we have laws to keep moviemakers from giving us filth ?"}
{"updated_label":"fallacy of logic","source_article":"Running the government is like running a business. You can’t keep running into debt and expect to be successful."}
{"updated_label":"fallacy of logic","source_article":"Doctors refer to medical books all the time when they are treating patients. In the same way, I should be allowed to use a text book in my medical exam."}
{"updated_label":"fallacy of logic","source_article":"If Joe eats greasy food, he will feel sick.\r\nJoe feels sick.\r\nTherefore, Joe ate greasy food."}
{"updated_label":"fallacy of logic","source_article":"People who are psychotic act in a bizarre manner. This person acts in a bizarre manner. Therefore: This person is psychotic."}
{"updated_label":"fallacy of logic","source_article":"If this client is competent to stand trial, she will certainly know the answers to at least 80% of the questions on this standardized test. She knows the answers to 87% of the test questions. Therefore she is competent to stand trial."}
{"updated_label":"fallacy of logic","source_article":"If I eat fast food for dinner, then I have a stomach ache in the evening. I had a stomach ache this evening. Therefore I ate fast food for dinner."}
{"updated_label":"fallacy of logic","source_article":"If Joe robbed a bank then he has a million dollars. Joe has a million dollars, so Joe robbed a bank."}
{"updated_label":"fallacy of logic","source_article":"If taxes are lowered, I will have more money to spend.\r\nI have more money to spend.\r\nTherefore, taxes must have been lowered."}
{"updated_label":"fallacy of logic","source_article":"If it’s brown, flush it down.\r\nI flushed it down.\r\nTherefore, it was brown."}
{"updated_label":"fallacy of logic","source_article":"I can’t stop eating these chocolates.  I really love chocolate, or I seriously lack willpower.  I know I really love chocolate; therefore, I cannot lack willpower."}
{"updated_label":"fallacy of logic","source_article":"I am going to bed or watching TV.  I am exhausted, so I will go to bed; therefore, I cannot watch TV."}
{"updated_label":"fallacy of logic","source_article":"We should stop using hairspray because it is snowing in New York."}
{"updated_label":"fallacy of logic","source_article":"Jack is a good athlete. Jack comes from Canada. Therefore, all Canadians are good athletes.\""}
{"updated_label":"fallacy of logic","source_article":"All men are mortal, and Socrates is a man, therefore Socrates likes dogs."}
{"updated_label":"fallacy of logic","source_article":"She's wearing red shoes. Her favorite color must be red."}
{"updated_label":"fallacy of logic","source_article":"He has my vote for senator, because he has the best shirts.\r\n\r\nWhat logic fallacy does this represent?"}
{"updated_label":"fallacy of logic","source_article":"People generally like to walk on the beach. Beaches have sand. Therefore, having sand floors in homes would be a great idea!"}
{"updated_label":"fallacy of logic","source_article":"We must have a poltergeist in the house. When the dog ran under the table, the vase just seemed to jump off the shelf all by itself."}
{"updated_label":"fallacy of logic","source_article":"\"People generally like to walk on the beach. Beaches have sand. Therefore, having sand floors in homes would be a great idea!\""}
{"updated_label":"fallacy of logic","source_article":"Good people don't lie. You told a lie. Therefore, you are not a good person."}
{"updated_label":"fallacy of logic","source_article":"I would have done my homework, but my refrigerator stopped working."}
{"updated_label":"fallacy of logic","source_article":"Bats are mammals. Bats can fly. Pigs are also mammals, therefore pigs can fly."}
{"updated_label":"fallacy of logic","source_article":"How can I be expected to do my homework when billions of people around the world are throwing their plastic water bottles away without recycling them?"}
{"updated_label":"fallacy of logic","source_article":"My fridge isn't working. I should probably finish that book I've been reading."}
{"updated_label":"fallacy of logic","source_article":"\"1 is a number and 2 is a number so 1 = 2\""}
{"updated_label":"fallacy of logic","source_article":"\"Men are human. Mary is a human. Therefore, Mary is a man.\""}
{"updated_label":"fallacy of logic","source_article":"\"If my hair looks nice, people will love me.\""}
{"updated_label":"fallacy of logic","source_article":"\"If you buy a computer, you will become smarter.\""}
{"updated_label":"fallacy of logic","source_article":"\"We both like music, so we should get married.\""}
{"updated_label":"fallacy of logic","source_article":"\"The research I found on cell phone use in the classroom suggests that students can be distracted when they have access to texting. This leads me to believe that all high school students should not be allowed to have their phones on them at school anytime."}
{"updated_label":"fallacy of logic","source_article":"He sometimes behaves violently when I am around him. I don't know what it is that I am doing to make him become so violent."}
{"updated_label":"fallacy of logic","source_article":"'Cotton and grain crops were lower this year than last. So, people must be stealing them.\"\r\nThis is an example of what kind of logical fallacy?"}
{"updated_label":"fallacy of logic","source_article":"Nuclear disarmament is a risk, but everything in life involves a risk. Every time you drive in a car you are taking a risk. If you're willing to drive in a car, you should be willing to have disarmament."}
{"updated_label":"fallacy of logic","source_article":"Mrs. Sedik really knows math; she would be an excellent math instructor."}
{"updated_label":"fallacy of logic","source_article":"Jim spends most of his spare time hiking and picking up rocks for his collection. He really should go to college and study to become a geologist."}
{"updated_label":"fallacy of logic","source_article":"Why should we worry about the negative depiction of women in music videos when thousands of women are dying of AIDS each year?"}
{"updated_label":"fallacy of logic","source_article":"Tens of thousands of Americans have seen lights in the night sky which they could not identify. The existence of life on other planets is fast becoming certainty !"}
{"updated_label":"fallacy of logic","source_article":"Bill lives in a large building, so his apartment must be large.\""}
{"updated_label":"fallacy of logic","source_article":"Buddy Burger has the greatest food in town.  Buddy Burger was voted #1 by the local paper.  Therefore, Phil, the owner of Buddy Burger, should run for president of the United States."}
{"updated_label":"fallacy of logic","source_article":"Most Arabs are Muslims and all the 9\/11 hijackers were also Muslims. Therefore most Arabs are hijackers."}
{"updated_label":"fallacy of logic","source_article":"Poetry is a based on rhythm, and music is based on rhythm, so isn't poetry a kind of music?"}
{"updated_label":"fallacy of logic","source_article":"Most heroin users started out smoking pot. If you start smoking pot, you’ll end up a heroin user, too."}
{"updated_label":"fallacy of logic","source_article":"All lions are animals.\r\nAll cats are animals.\r\nTherefore, all lions are cats."}
{"updated_label":"fallacy of logic","source_article":"All ghosts are imaginary.\r\nAll unicorns are imaginary.\r\nTherefore, all ghosts are unicorns."}
{"updated_label":"fallacy of logic","source_article":"The lady in the pink dress is Julia Roberts.\r\nThe reporter thinks Julia Roberts drives a Prius.\r\nTherefore, the reporter thinks the lady in the pink dress drives a Prius."}
{"updated_label":"fallacy of logic","source_article":"All cats are felines.\r\nAll dogs are canines.\r\nTherefore, all cats are canines."}
{"updated_label":"fallacy of logic","source_article":"All Greek gods are mythical.\r\nAll modern day gods are real.\r\nTherefore, all Greek gods are real."}
{"updated_label":"fallacy of logic","source_article":"All hotdogs are fast food.\r\nNo hamburgers are hotdogs.\r\nTherefore, no hamburgers are fast food."}
{"updated_label":"fallacy of logic","source_article":"All Jim Carrey movies are hilarious.\r\nNo horror movies are Jim Carrey movies.\r\nTherefore, no horror movies are hilarious."}
{"updated_label":"fallacy of logic","source_article":"All Catholics are Christian.\r\nAll Christians are Jesus lovers.\r\nTherefore, all Jesus lovers are Catholic."}
{"updated_label":"fallacy of logic","source_article":"All Paul Newman movies are great.\r\nAll great movies are Oscar winners.\r\nTherefore, all Oscar winners are Paul Newman movies."}
{"updated_label":"fallacy of logic","source_article":"All babysitters have pimples.\r\nAll babysitter club members are babysitters.\r\nTherefore, some babysitter club members have pimples.Example #2:\r\nAll forest creatures live in the woods.\r\nAll leprechauns are forest creatures.\r\nTherefore, some leprechauns live in the woods.\r\n"}
{"updated_label":"fallacy of logic","source_article":"All forest creatures live in the woods.\r\nAll leprechauns are forest creatures.\r\nTherefore, some leprechauns live in the woods."}
{"updated_label":"fallacy of logic","source_article":"All cats are animals.\r\nSome pets are cats.\r\nTherefore, some pets are not animals."}
{"updated_label":"fallacy of logic","source_article":"All boys are sports fans.\r\nSome bakers are boys.\r\nTherefore, some bakers are not sports fans."}
{"updated_label":"fallacy of logic","source_article":"No people under the age of 66 are senior citizens.\r\nNo senior citizens are children.\r\nTherefore, all people under the age of 66 are children."}
{"updated_label":"fallacy of logic","source_article":"No donkeys are fish.\r\nSome asses are donkeys.\r\nTherefore, some asses are fish."}
{"updated_label":"fallacy of logic","source_article":"No kangaroos are MMA fighters.\r\nSome MMA fighters are not Mormons.\r\nTherefore, some Mormons are not kangaroos."}
{"updated_label":"fallacy of logic","source_article":"No animals are insects.\r\nNo insects are dogs.\r\nTherefore, no dogs are animals."}
{"updated_label":"fallacy of logic","source_article":"If this test were based on fraudulent norms, then it would be invalid. But the norms are not fraudulent. Therefore, this test is valid."}
{"updated_label":"fallacy of logic","source_article":"If it barks, it is a dog.\r\nIt doesn’t bark.\r\nTherefore, it’s not a dog."}
{"updated_label":"fallacy of logic","source_article":"If I have cable, then I have seen a naked lady.\r\nI don’t have cable.\r\nTherefore, I have never seen a naked lady."}
{"updated_label":"appeal to emotion","source_article":"I know you don't like the cat sweater that Grandma knitted for you, but she worked so hard on it, and it will make her happy to see you wear it in the family holiday photo."}
{"updated_label":"appeal to emotion","source_article":"Which fallacy is the following example? \"By rejecting God, you are rejecting goodness, kindness, and love itself.\""}
{"updated_label":"appeal to emotion","source_article":"They are dangerous militants out to destroy our peaceful way of life."}
{"updated_label":"appeal to emotion","source_article":"A real estate ad shows a happy family moving in to the home of their dreams."}
{"updated_label":"appeal to emotion","source_article":"A commercial shows images of animals in need to persuade the audience to make donations."}
{"updated_label":"appeal to emotion","source_article":"\"It is an outrage that the school wants to remove the vending machines. This is taking our freedom away!\""}
{"updated_label":"appeal to emotion","source_article":"Television Advertisement: Get all of your stains out by using new and improved Ultra Suds and wash your blues away!"}
{"updated_label":"appeal to emotion","source_article":"An advertisement asking people to give to St. Jude Research Center to help children struggling with cancer. You wouldn't want to let these children die, right?"}
{"updated_label":"appeal to emotion","source_article":"Janice just lost her goldfish and so asks you to give her the benefit of the doubt. What fallacy has she committed?"}
{"updated_label":"appeal to emotion","source_article":"\"You will never be satisfied in life if you don’t seize this opportunity. Do you want to live the rest of your years yearning to know what would have happened if you just jumped when you had the chance?\" Which appeal is the primary appeal used in this quote?"}
{"updated_label":"appeal to emotion","source_article":"Don’t waste food, people in Marawi are suffering because of hunger."}
{"updated_label":"appeal to emotion","source_article":"“A bank with the heart for every Filipino” - Veterans Bank"}
{"updated_label":"appeal to emotion","source_article":"\"You'll make the right decision because you have something that not many people do: you have heart.\"?"}
{"updated_label":"appeal to emotion","source_article":"When President Kennedy said that research for space travel could help children with eye defects, he is making what kind of appeal?"}
{"updated_label":"appeal to emotion","source_article":"Power lines cause cancer.  I met a little boy with cancer who lived just 20 miles from a power line who looked into my eyes and said, in his weak voice, “Please do whatever you can so that other kids won’t have to go through what I am going through.”"}
{"updated_label":"appeal to emotion","source_article":"We have a responsibility to care for this poor lost dog."}
{"updated_label":"appeal to emotion","source_article":"We will not rest until we reach a day when not one single veteran falls into homelessness."}
{"updated_label":"appeal to emotion","source_article":"Thousands of pets are left homeless and hungry because lousy people turn them out on the streets instead of taking care of them."}
{"updated_label":"appeal to emotion","source_article":"You should always eat everything on your plate, think of all the children in Africa who doesn’t always have enough food."}
{"updated_label":"appeal to emotion","source_article":"If we don't control Covid-19, it could lead to millions of deaths. Wouldn't it make you sad to live in a country where that had happened?"}
{"updated_label":"appeal to emotion","source_article":"They cannot take her to jail even if she did rob the bank and take millions of pesos… She is already too old and weak to be locked up."}
{"updated_label":"appeal to emotion","source_article":"A commercial featuring starving children in Africa asking for donations to help provide food and clean water to those in need."}
{"updated_label":"appeal to emotion","source_article":"There must be objective rights and wrongs in the universe. If not, how can you possibly say that torturing babies for fun could ever be right?"}
{"updated_label":"appeal to emotion","source_article":"That lady had a rough day today. She woke up late, she was not able to eat breakfast, she missed the train and was late for work. My heart aches for this poor lady."}
{"updated_label":"appeal to emotion","source_article":"\"A dog would be a great addition to our family. Think about how wonderful it would be to come home to a happy, excited, loving dog?\" This is an example of which persuasive technique?"}
{"updated_label":"appeal to emotion","source_article":"Hundreds of thousands of animals are being tortured and killed every year, and for what? So that we can modernize our beauty products and overstock our grocery stores?"}
{"updated_label":"appeal to emotion","source_article":"Which type of appeal is used in the following phrase from the Declaration of Independence: “He has plundered our seas, ravaged our coasts, burned our towns, and destroyed the lives of our people”?"}
{"updated_label":"appeal to emotion","source_article":"Luke didn't want to eat his sheep's brains with chopped liver and brussel sprouts, but his father told him to think about the poor, starving children in a third world country who weren't fortunate enough to have any food at all."}
{"updated_label":"appeal to emotion","source_article":"There must be objective rights and wrongs in the universe.  If not, how can you possibly say that torturing babies for fun could ever be right?"}
{"updated_label":"appeal to emotion","source_article":"By rejecting God, you are rejecting goodness, kindness, and love itself."}
{"updated_label":"appeal to emotion","source_article":"I don’t see what’s wrong with engaging the services of a professional escort."}
{"updated_label":"appeal to emotion","source_article":"You have to give me a passing grade. I spent 150 hours on that project and missed every party this quarter."}
{"updated_label":"appeal to emotion","source_article":"Luke didn't want to eat his vegetables, but his father told him to think about the poor, starving children in a third world country who don't have anything to eat."}
{"updated_label":"appeal to emotion","source_article":"We shouldn’t put her in jail even if she stole billions of pesos. She is already too old to be locked up."}
{"updated_label":"appeal to emotion","source_article":"\"I should receive an 'A' in this class. I had a tough week!\" Hadi begged"}
{"updated_label":"appeal to emotion","source_article":"\"If we don't adopt that puppy today, they might put him down. Do you want to be responsible for that?\" Exclaimed Yasir."}
{"updated_label":"appeal to emotion","source_article":"“I know the exam is graded based on performance, but you should give me an A. My cat has been sick, my car broke down, and I’ve had a cold, so it was really hard for me to study!” Demanded Aun."}
{"updated_label":"appeal to emotion","source_article":"“I really deserve an “A” on this paper, professor. Not only did I study during my grandmother’s funeral, but I also passed up the heart transplant surgery, even though that was the first matching donor in 3 years.”"}
{"updated_label":"appeal to emotion","source_article":"We should give the other applicant the job because he has a poor family and he needs to provide for them. It looks like he suffers a lot!"}
{"updated_label":"appeal to emotion","source_article":"If you write to Mrs. Roth and tell her: \"Mrs Roth, I know I haven't done any of the assignments, but I need a C anyway because I'm asking nicely and I'm good person, and I'm going to get in trouble if you don't.\""}
{"updated_label":"appeal to emotion","source_article":"Saying that you support a specific candidate for class president, only because he has recently been diagnosed with cancer is an example of which fallacy?"}
{"updated_label":"appeal to emotion","source_article":"\"I know the exam is graded based on performance, but you should give me an A. My cat has been sick, my car broke down, and I've had a cold, so it was really hard for me to study!\""}
{"updated_label":"appeal to emotion","source_article":"You don’t have to do this. My grandmother is in the hospital. I need my salary to support her medication. She’s dying."}
{"updated_label":"appeal to emotion","source_article":"Just give me a chance to prove it to you. I can’t live this life if you will leave me. My world will stop to turn around. I will not be able to eat nor drink."}
{"updated_label":"appeal to emotion","source_article":"Won't you give the abandoned puppy a home?"}
{"updated_label":"appeal to emotion","source_article":"\"Sir, please let me take the exam. I was late because I need to cook our breakfast and wash the dishes.\""}
{"updated_label":"appeal to emotion","source_article":"\"Every 0.008 seconds in the United States, a teen accidentally shatters his\/her phone screen. You can help put an end to these devastating tragedies: donate now to my Kickstarter fund, the new Bubble-wrap Phone Case X.\""}
{"updated_label":"appeal to emotion","source_article":"\"I know I made a bad decision, but look at how hard I tried.\"\r\nThis helps manipulators to avoid taking responsibility for their actions."}
{"updated_label":"appeal to emotion","source_article":"\"You cannot detain me. I am still grieving my cat's death.\""}
{"updated_label":"appeal to emotion","source_article":"You really should support Senator Jones and his campaign to strengthen national defense. If you do not, he will lose control of the Armed Forces Committee and likely resign from politics."}
{"updated_label":"appeal to emotion","source_article":"You've got to donate to the hockey team. They are helping build schools in Uganda. Imagine all of those poor and hungry kids there."}
{"updated_label":"appeal to emotion","source_article":"I should receive an 'A' in this class. After all, if I don't get an 'A' I won't get the fellowship that I want."}
{"updated_label":"appeal to emotion","source_article":"I really deserve an “A” on this paper, professor.  Not only did I study during my grandmother’s funeral, but I also passed up the heart transplant surgery, even though that was the first matching donor in 3 years."}
{"updated_label":"appeal to emotion","source_article":"Ginger: Your dog just ran into our house and ransacked our kitchen!\r\nMary: He would never do that, look at how adorable he is with those puppy eyes!\r\n"}
{"updated_label":"appeal to emotion","source_article":"Children should not go trick or treating, as there always\r\nexists the possibility that someone could poison the treats."}
{"updated_label":"appeal to emotion","source_article":"If we don’t teach teens to work harder, the human race is doomed."}
{"updated_label":"appeal to emotion","source_article":"If you love your family, you'll buy this new stealth\r\nsecurity system."}
{"updated_label":"appeal to emotion","source_article":"Sometimes kids ride skateboards and fall off, breaking their arms or legs. Clearly, riding a skateboard is extremely dangerous. Don’t you think skateboards should be banned?"}
{"updated_label":"appeal to emotion","source_article":"A mother tells her children not to leave the yard because there might be wild animals in the woods."}
{"updated_label":"appeal to emotion","source_article":"\"If you don't turn in your homework, you will be getting a call home."}
{"updated_label":"appeal to emotion","source_article":"Claiming that \"If you elect him, the Dow Jones will tumble and you will lose all of your money!\" is an example of:"}
{"updated_label":"appeal to emotion","source_article":"My family is this school's biggest donor so, you better think about that bad grade you gave me on my test."}
{"updated_label":"appeal to emotion","source_article":"\"Politician X is going to strip away your right to free speech!\""}
{"updated_label":"appeal to emotion","source_article":"If you don't start recycling now, our entire planet will be destroyed in ten years."}
{"updated_label":"appeal to emotion","source_article":"\"If you don't believe in God, you'll go to hell!\" is an example of:"}
{"updated_label":"appeal to emotion","source_article":"I ask all employees to vote for my chosen candidate in the upcoming elections. If the other candidate wins, he will raise taxes and many of you will lose your jobs."}
{"updated_label":"appeal to emotion","source_article":"Senator Jones supports a strong national defense. If you do vote for him, our country will be invaded, and it will start World War III."}
{"updated_label":"appeal to emotion","source_article":"Explaining that trusting the other politician will cause everyone to lose their homes and jobs"}
{"updated_label":"appeal to emotion","source_article":"\"If you don't buy the warranty for your chromebook, you could find yourself without one for the rest of the schoolyear and having to pay thousands of dollars in expensive repairs\" IS an example of this fallacy."}
{"updated_label":"appeal to emotion","source_article":"If you don't buy the black pencils, you will get made fun of. You will not be chosen for group projects."}
{"updated_label":"appeal to emotion","source_article":"If we don’t bail out the big automakers, the US economy will collapse.  Therefore, we need to bail out the automakers."}
{"updated_label":"appeal to emotion","source_article":"Timmy: Mom, what if I don’t believe in God?\r\nMom: Then you burn in Hell forever.  Why do you ask?\r\nTimmy: No reason.\r\n"}
{"updated_label":"appeal to emotion","source_article":"It takes faith to believe in God just like it takes faith to believe in the Easter Bunny -- but at least the Easter Bunny is based on a creature that actually exists!"}
{"updated_label":"appeal to emotion","source_article":"I am going into surgery tomorrow so please pray for me.  If enough people pray for me, God will protect me from harm and see to it that I have a successful surgery and speedy recovery."}
{"updated_label":"appeal to emotion","source_article":"If everyone lived his or her life exactly like Jesus lived his life, the world would be a beautiful place!"}
{"updated_label":"appeal to emotion","source_article":"You should choose to work more overtime at the same rate of pay. After all, you wouldn’t want to lose your job, would you?"}
{"updated_label":"appeal to emotion","source_article":"The Department of Transportation needs to reconsider the speed limit proposals on interstate highways for the simple reason that if they do not, their departmental budget for the Department of Transportation will be cut by 25%."}
{"updated_label":"appeal to emotion","source_article":"Speaker 1: I'll never talk.\r\nSpeaker 2: We have ways of making you talk."}
{"updated_label":"appeal to emotion","source_article":"In the race for mayor, Lara says a vote for her opponent will lead to you losing your job. What fallacy has she committed?"}
{"updated_label":"appeal to emotion","source_article":"\"Don't make me angry; you won't like me when I'm angry.\""}
{"updated_label":"appeal to emotion","source_article":"Our gang will beat up anyone who doesn’t vote our way"}
{"updated_label":"appeal to emotion","source_article":"Melvin: Boss, why do I have to work weekends when nobody else in the company does?\r\nBoss: Am I sensing insubordination?  I can find another employee very quickly, thanks to Craigslist, you know.\r\n"}
{"updated_label":"appeal to emotion","source_article":"Jordan: Dad, why do I have to spend my summer at Jesus camp?\r\nDad: Because if you don’t, you will spend your entire summer in your room with nothing but your Bible!\r\n"}
{"updated_label":"appeal to emotion","source_article":"If there is objective morality, then good moral behavior will be rewarded after death.  I want to be rewarded; therefore, morality must be objective."}
{"updated_label":"appeal to emotion","source_article":"If there is no objective morality, then all the bad people will not be punished for their bad behavior after death.  I don’t like that; therefore, morality must be objective."}
{"updated_label":"appeal to emotion","source_article":"If there is no freewill, then we are not ultimately in control of our actions. If this is true, our entire system of justice would be seriously flawed. This would be very bad; therefore, freewill must exist."}
{"updated_label":"appeal to emotion","source_article":"I believe that when we die, we will spend eternity reading books and learning more about writing composition. I am so comforted by this belief!"}
{"updated_label":"appeal to emotion","source_article":"I know in my heart of hearts that our home team will win the World Series."}
{"updated_label":"appeal to emotion","source_article":"I believe that when we die, we are all given new, young, perfect bodies, and we spend eternity with those whom we love. I can’t imagine the point of life if it all just ends when we die!"}
{"updated_label":"appeal to emotion","source_article":"Maria has been working at her current job for more than 30 years at the same wage. She desperately wants a raise so she approaches her boss to ask for one. She says, \"You are one of the kindest people I know. You are smart and good-looking and I really love your shoes.\""}
{"updated_label":"appeal to emotion","source_article":"You should certainly be the one who washes the dishes -- you are just so good at it!"}
{"updated_label":"appeal to emotion","source_article":"Salesguy: You should definitely buy this car.  You look so good in it -- you look at least ten years younger behind that wheel.\r\nTamera: I’ll take it!\r\n"}
{"updated_label":"false dilemma","source_article":"We either ban hairspray or the world will end."}
{"updated_label":"false dilemma","source_article":"You need to go to the party with me, otherwise you’ll just be bored at home."}
{"updated_label":"false dilemma","source_article":"\"To get better schools, we have to raise taxes. If we don't, we can't have better schools.\""}
{"updated_label":"false dilemma","source_article":"The museum's new gemstones and precious minerals exhibit needs more security guards. If you don't agree, then you must be planning to steal a piece of the exhibit"}
{"updated_label":"false dilemma","source_article":"Either you decide that you can afford this stereo, or decide not to have music for a while"}
{"updated_label":"false dilemma","source_article":"Too much candy can cause cavities. You should avoid eating any candy unless you want cavities."}
{"updated_label":"false dilemma","source_article":"Either you can save your money to buy a new car for yourself, or you can just take an Uber around for the rest of your life."}
{"updated_label":"false dilemma","source_article":"Either you text your friend or you don't have any fun at all."}
{"updated_label":"false dilemma","source_article":"\"The only solutions I can see to climate change is either mass extinction of humans, or passing this green bill.\""}
{"updated_label":"false dilemma","source_article":"Either you love bacon, or you're wrong."}
{"updated_label":"false dilemma","source_article":"If you drive without car insurance, then you’re an accident waiting to happen.\r\nStay protected with Auto Union insurance."}
{"updated_label":"false dilemma","source_article":"Look, you are going to have to make up your mind. Either you decide that you can afford this stereo, or you decide you are going to do without music for a while"}
{"updated_label":"false dilemma","source_article":"Student: You didn't teach us this; we never learned this.\r\n\r\nTeacher: So, you're either lazy or unwilling to learn is that right?"}
{"updated_label":"false dilemma","source_article":"If you don't say the Pledge of Allegiance, then you must be a traitor."}
{"updated_label":"false dilemma","source_article":"I'm raising funds to help cure XYZ disease. If you don't donate, then you're part of the problem."}
{"updated_label":"false dilemma","source_article":"People either like coffee or hate it."}
{"updated_label":"false dilemma","source_article":"Subscribe to our streaming services, or get stuck with cable!"}
{"updated_label":"false dilemma","source_article":"Sukaina to her mom: Either you buy me this new book, or you decide that reading is not important at all."}
{"updated_label":"false dilemma","source_article":"\"Either you pass this test, or you fail it.\" Laughed Sr Malak"}
{"updated_label":"false dilemma","source_article":"You can buy the new Sensitivity perfume, or you can smell bad all day."}
{"updated_label":"false dilemma","source_article":"We either have to cut taxes or leave a huge debt for our children."}
{"updated_label":"false dilemma","source_article":"We cannot support immigrants because we have too many homeless and poor Americans."}
{"updated_label":"false dilemma","source_article":"Vote for me or live through four more years of higher taxes."}
{"updated_label":"false dilemma","source_article":"You can look cool in our clothes, or you can look like a loser."}
{"updated_label":"false dilemma","source_article":"Either we go to war, or we appear weak"}
{"updated_label":"false dilemma","source_article":"Either you love me, or you hate me."}
{"updated_label":"false dilemma","source_article":"The school is in bad shape. Either we tear it down and put up a new building, or we continue to risk students’ safety. Obviously, we shouldn’t risk anyone’s safety, so we must tear the building down.”"}
{"updated_label":"false dilemma","source_article":"If it wasn't a missile, a bomb, or mechanical failure, then all that's left is a meteorite."}
{"updated_label":"false dilemma","source_article":"“I didn’t see you at the charity fundraiser today. I guess you are not a good person after all.”"}
{"updated_label":"false dilemma","source_article":"Either we ban teenagers from possessing cell phones or we continue to let thousands of young students fail their classes."}
{"updated_label":"false dilemma","source_article":"America:  love it or leave it. Either you’re for us or against us."}
{"updated_label":"false dilemma","source_article":"Dad, either you let me go to the party or you're a bad dad."}
{"updated_label":"false dilemma","source_article":"You are either a leader or a follower."}
{"updated_label":"false dilemma","source_article":"The museum's new gemstones and precious minerals exhibit needs more security guards. If you don't agree, then you must be planning to steal a piece of the exhibit."}
{"updated_label":"false dilemma","source_article":"If Mom didn't turn off the air conditioner, then clearly she must be too hot."}
{"updated_label":"false dilemma","source_article":"All of my friends are coming to my birthday party. If Micah doesn't, she might as well tell me that she doesn't like me."}
{"updated_label":"false dilemma","source_article":"“Either you love me, or you hate me.”"}
{"updated_label":"false dilemma","source_article":"\"Either you recycle or you don't care about human life.\""}
{"updated_label":"false dilemma","source_article":"I’m raising funds to help cure XYZ disease. If you don’t donate, then you’re part of the problem."}
{"updated_label":"false dilemma","source_article":"If you don't say the pledge of allegiance, then you must be a traitor."}
{"updated_label":"false dilemma","source_article":"We should ban all hairspray or the world will end!"}
{"updated_label":"false dilemma","source_article":"”You can start a family early, or build financial stability for a better family life in the future.”"}
{"updated_label":"false dilemma","source_article":"“Eat great food at our restaurant, or eat sad, boring meals at home.”"}
{"updated_label":"false dilemma","source_article":"Politician: We have to decide if we are going to support school choice or if we are going to support failing schools. Those are the only two options."}
{"updated_label":"false dilemma","source_article":"I thought you cared about other people, but I didn't see you at the fundraiser for the Children's Hospital ..."}
{"updated_label":"false dilemma","source_article":"\"If you never gave money to charity, then you must be a greedy millionaire.\" What is this?"}
{"updated_label":"false dilemma","source_article":"\"Either you are for us, or you're against us!\""}
{"updated_label":"false dilemma","source_article":"Look, the only way to improve social programs is to raise taxes. You have to either raise taxes, or accept that the poor and needy are going to suffer."}
{"updated_label":"false dilemma","source_article":"When someone says, \"Either schools need to fully open immediately and no students should wear masks or all teachers are Communists!\""}
{"updated_label":"false dilemma","source_article":"Look, you are going to have to make up your mind. Either you decide that you can afford this stereo, or you decide you are going to do without music for a while."}
{"updated_label":"false dilemma","source_article":"You're with us or you're against us."}
{"updated_label":"false dilemma","source_article":"I thought you were a good person, but you were not at church today."}
{"updated_label":"false dilemma","source_article":"Either go to the party or spend the night in your room crying."}
{"updated_label":"false dilemma","source_article":"Purchase our product or no one is going to think you’re attractive."}
{"updated_label":"false dilemma","source_article":"You've got to teach the boys logic! If you don't teach them logic, they won't learn how to think, and they'll become hobos and die in prison! Don't you care about your sons? (Mother to Father)"}
{"updated_label":"false dilemma","source_article":"\"Vote for Smith or live through four more years of higher taxes.\""}
{"updated_label":"false dilemma","source_article":"You either are for us or you are all against"}
{"updated_label":"false dilemma","source_article":"We can either stop using cars or destroy the earth."}
{"updated_label":"false dilemma","source_article":"\"You can be a good politician and play dirty or you can drop out.\""}
{"updated_label":"false dilemma","source_article":"I thought you were a good person, but you weren’t in class today."}
{"updated_label":"false dilemma","source_article":"\"Either the city should provide recycling bins or throw out the Recycling Act\" is an example of:"}
{"updated_label":"false dilemma","source_article":"\"Either we re-elect Mayor Ruiz, or we watch our city fall to pieces\" is an example of"}
{"updated_label":"false dilemma","source_article":"Growing up, many children are told to eat their dinner or else they would never grow big and tall. What fallacy is this?"}
{"updated_label":"false dilemma","source_article":"Dana is trying to raise money for her university's library. In her address to the board of trustees, she says, \"We must raise tuition to cover the cost of new books. Otherwise the library will be forced to close.\"\r\n\r\nOf what fallacy is this an example?"}
{"updated_label":"false dilemma","source_article":"You either support Hillary Clinton for President or you don’t believe in women’s rights."}
{"updated_label":"false dilemma","source_article":"You can go to bed in 5 minutes or you can go to bed in ten minutes. What's your choice?"}
{"updated_label":"false dilemma","source_article":"We can either agree with Barbara's plan or just let the project fail. There is no other option."}
{"updated_label":"false dilemma","source_article":"“If you really loved me, you would buy me everything I ever wanted!”"}
{"updated_label":"false dilemma","source_article":"There are two kinds of people in this world: those who like penguins, and those who are terrible monsters."}
{"updated_label":"false dilemma","source_article":"Your either for America or against her!!!"}
{"updated_label":"false dilemma","source_article":"Either you eat this meatloaf or you eat nothing."}
{"updated_label":"false dilemma","source_article":"You either support Hillary Clinton for President or you don't believe in women's rights"}
{"updated_label":"false dilemma","source_article":"“Live with me or live on the streets”"}
{"updated_label":"false dilemma","source_article":"I called my friend and he didn't answer. He wasn't home or he was dead."}
{"updated_label":"false dilemma","source_article":"We can have Sally as our soldier or we can have Brittany be the queen of the kingdom."}
{"updated_label":"false dilemma","source_article":"Person 1: You’re either for the war or against the troops.\r\n\r\nPerson 2: Actually, I do not want our troops sent into a dangerous war."}
{"updated_label":"false dilemma","source_article":"Unless you can close your eyes to abuse, write a check to save this puppy."}
{"updated_label":"false dilemma","source_article":"\"If you do not submit your requirements today, you should drop your classes with Sir Lean.\""}
{"updated_label":"false dilemma","source_article":"You can either start using plastic straws or continue killing ocean life with plastic pollution."}
{"updated_label":"false dilemma","source_article":"It is either you are for the US war on terror or against it."}
{"updated_label":"false dilemma","source_article":"The music industry must either raise album prices or reduce pay for technicians and producers."}
{"updated_label":"false dilemma","source_article":"If we are too scared to open the economy completely, then we'll have to keep it closed forever."}
{"updated_label":"false dilemma","source_article":"\"You are either with me or against me!\" is an example of which fallacy?"}
{"updated_label":"false dilemma","source_article":"Either support gun confiscation or have the government provide everyone with his own private nuclear warhead, you decide which one."}
{"updated_label":"false dilemma","source_article":"“You could either pursue your dream job or stay where you are and be miserable for the rest of your life.”"}
{"updated_label":"false dilemma","source_article":"I'm raising money to help cure XYZ disease. If you do not donate, you are part of the problem."}
{"updated_label":"false dilemma","source_article":"“Do you want to live in a world where you can get breakfast from McDonald’s all day, or would you rather live in a dictatorship?”"}
{"updated_label":"false dilemma","source_article":"\"America: Love it or leave it\"\r\nThis is an example of which kind of logical fallacy?"}
{"updated_label":"false dilemma","source_article":"\"Judge Danforth in the play, 'The Crucible,' offers Proctor two choice: you are either with this court or against it\" IS an example of this fallacy."}
{"updated_label":"false dilemma","source_article":"\"Either we have the full football season or we scrap it altogether and have zero football\" IS an example of what fallacy?"}
{"updated_label":"false dilemma","source_article":"Look, you are going to have to make up your mind. Either, you decide that you can afford this stereo, or your decide that you are going to have to go without music for a while."}
{"updated_label":"false dilemma","source_article":"I thought you were a good person, but you weren’t at church today."}
{"updated_label":"false dilemma","source_article":"We as the Board can either choose to approve this initial public offering or we can suffer slow annihilation at the hands of our competitors."}
{"updated_label":"false dilemma","source_article":"“Are you going to do well in school, or are you going to succeed as a cadet?”"}
{"updated_label":"false dilemma","source_article":"“We can give cadets awards for doing well, or we can have a disciplined squadron. We can’t do both.”"}
{"updated_label":"false dilemma","source_article":"Hillary Clinton wants to take your guns away, and she wants to abolish the Second Amendment."}
{"updated_label":"false dilemma","source_article":"If you don't pay taxes, you don't deserve the right to vote."}
{"updated_label":"false dilemma","source_article":"Whilst rallying support for his plan to fundamentally undermine citizens' rights, the Supreme Leader told the people they were either on his side, or they were on the side of the enemy."}
{"updated_label":"false dilemma","source_article":"These test results are clearly wrong, and it must be either because the client was malingering or because I bungled the test administration. Taking another look at the test manual, I see now that I bungled the test administration. Therefore the client was not malingering."}
{"updated_label":"false dilemma","source_article":"Either we accept the findings of this study demonstrating that this new intervention is the best to be used for this disorder, or we must no longer call ourselves scientists, psychologists, or reasonable people."}
{"updated_label":"false dilemma","source_article":"If you can't prove that Ken had an affair with the nanny, then he's been faithful to his wife.\t"}
{"updated_label":"false dilemma","source_article":"Senator Jill: \"We'll have to cut education funding this year.\"\r\nSenator Bill: \"Why?\"\r\nSenator Jill: \"Well, either we cut the social programs or we live with a huge deficit and we can't live with the deficit.\""}
{"updated_label":"false dilemma","source_article":"You are either with God or against him."}
{"updated_label":"fallacy of credibility","source_article":"You ask your mother if you can go to the mall with your friends. She says \"no\". You ask why? She says, \"because I'm the mom and I say so\". This is an example of which logical fallacy?"}
{"updated_label":"fallacy of credibility","source_article":"Famous actors like Alex Gonzaga and Philip Salvador support Oplan Tokhang, so it must be an effective operation."}
{"updated_label":"fallacy of credibility","source_article":"We should move to the Midwest because Mujtaba from the Wall Street Journal says the cost of living is cheaper there."}
{"updated_label":"fallacy of credibility","source_article":"“We should abolish the death penalty. Many respected people, such as Imran Kader, have publicly stated their opposition to it.”"}
{"updated_label":"fallacy of credibility","source_article":"Since Dwayne Johnson (aka The Rock) endorsed this protein powder, it must work wonders."}
{"updated_label":"fallacy of credibility","source_article":"“Richard Dawkins, an evolutionary biologist and perhaps the foremost expert in the field, says that evolution is true. Therefore, I believe it's true.”"}
{"updated_label":"fallacy of credibility","source_article":"“four out of five dentists agree that brushing your teeth makes your life meaningful”"}
{"updated_label":"fallacy of credibility","source_article":"\"Stephen Hawking in the smartest scientist on the planet, so if he says global warming is real, it must be true!\""}
{"updated_label":"fallacy of credibility","source_article":"“Police officers agree that Blackjack Steering Wheel Locks are the most effective deterrent against car theft.”"}
{"updated_label":"fallacy of credibility","source_article":"Richard Dawkins, an evolutionary biologist and perhaps the foremost expert in the field, says that evolution is true. Therefore, it's true."}
{"updated_label":"fallacy of credibility","source_article":"A book argues that global warming is not actually happening, and cites the research of one environmental scientist who has been studying climate change for several years."}
{"updated_label":"fallacy of credibility","source_article":"A little boy says that his friends should not go swimming in a river because his Mama said there were germs in the river."}
{"updated_label":"fallacy of credibility","source_article":"My sister-in-law, who is a teacher, said that this school is not somewhere that I would want to send my children."}
{"updated_label":"fallacy of credibility","source_article":"Look, it doesn't matter whether or not you think America should build a wall on the border. The President thinks America should do it, so it's a good idea."}
{"updated_label":"fallacy of credibility","source_article":"Lebron James, one of the most decorated basketball players of all time, says you need to eat breakfast so you need to eat breakfast"}
{"updated_label":"fallacy of credibility","source_article":"Ms. Drayer, the smartest person in the universe, says the debate is the best class, therefore it is."}
{"updated_label":"fallacy of credibility","source_article":"We should abolish the death penalty. Even Taylor Swift is opposed to it."}
{"updated_label":"fallacy of credibility","source_article":"An ad claims that 3 out of 4 real estate agents reccommend moving to Sunnyville, California."}
{"updated_label":"fallacy of credibility","source_article":"Invoke shared values and principles. They call upon the audience’s sense of right and wrong."}
{"updated_label":"fallacy of credibility","source_article":"I saw Ashton Kutcher in a commercial for male skin care. He's looking good for his age, so I'm willing to try the product. He must know what he's talking about."}
{"updated_label":"fallacy of credibility","source_article":"You said that because an authority thinks something, it must therefore be true."}
{"updated_label":"fallacy of credibility","source_article":"Ross Geller, an evolutionary biologist and perhaps the foremost expert in the field, says that evolution is true. Therefore, it's true."}
{"updated_label":"fallacy of credibility","source_article":"A commercial claims that a specific brand of cereal is the best way to start the day because athlete Michael Jordan says that it is what he eats every day for breakfast."}
{"updated_label":"fallacy of credibility","source_article":"\"You know me - I've taught Sunday School at your church for years, babysat your children, and served as a playground director for many summers - so you know I can run your preschool.\"?"}
{"updated_label":"fallacy of credibility","source_article":"We should abolish the death penalty. Even Judge Judy is opposed to it."}
{"updated_label":"fallacy of credibility","source_article":"\"Dra. Vicky Belo said that all kind of cars need fuel to start.\"\r\n\r\nWhat fallacy is being committed in the sentence above?"}
{"updated_label":"fallacy of credibility","source_article":"I have served over 20 years in the military, and based on my professional opinion, I believe more money needs to be spent on protective armor and military vehicles."}
{"updated_label":"fallacy of credibility","source_article":"As a police officer who has worked for the city for 15 years, I have been a witness to distracted drivers and something needs to be done."}
{"updated_label":"fallacy of credibility","source_article":"My friend said that if you sneeze more than three times, you have the corona virus."}
{"updated_label":"fallacy of credibility","source_article":"Despite the fact that our Q4 numbers are much lower than usual, we should push forward using the same strategy because our CEO Barbara says this is the best approach."}
{"updated_label":"fallacy of credibility","source_article":"Dr. McKenzie said all kids can fly, so it must be true!"}
{"updated_label":"fallacy of credibility","source_article":"SM 10: Local talk show host saying we are on the verge of a nuclear war leading to sitting in a basement for months."}
{"updated_label":"fallacy of credibility","source_article":"\"We should abolish the death penalty. Many respected people, such as actor, Chewbacca, have publicly stated their opposition to it.\""}
{"updated_label":"fallacy of credibility","source_article":"“I admire the president for being a good role model.” REPLY: “But the New York Times says he’s a lousy role model, so you’re wrong.”"}
{"updated_label":"fallacy of credibility","source_article":"“The purpose of the Cadet Program is to prepare youth for Air Force Basic Military Training.” REPLY: “This is true because I heard it from the Wing Commander.”"}
{"updated_label":"fallacy of credibility","source_article":"Hi, I’m Troy McClure. You might remember me from such films as The Day the Peacock Died. After filming scenes with feathered co-stars all day, there’s nothing I enjoy more than a bucket of Buster’s Chicken. It’s chickentastic!"}
{"updated_label":"fallacy of credibility","source_article":"Not able to defend his position that evolution 'isn't true' Bob says that he knows a scientist who also questions evolution (and presumably isn't a primate)."}
{"updated_label":"fallacy of credibility","source_article":"We should move to the midwest because the Wall Street Journal says the cost of living is cheaper there."}
{"updated_label":"fallacy of credibility","source_article":"How do I know the adult film industry is the third largest industry in the United States? Derek Shlongmiester, the adult film star of over 50 years, said it was. That's how I know."}
{"updated_label":"fallacy of credibility","source_article":"My professor, who has a Ph.D. in Astronomy, once told me that ghosts are real. Therefore, ghosts are real."}
{"updated_label":"fallacy of credibility","source_article":"I saw Ashton Kutcher in a prescription drug commercial, therefore it has to be an effective drug."}
{"updated_label":"fallacy of credibility","source_article":"Because doctors smoke it must be a healthy choice."}
{"updated_label":"fallacy of credibility","source_article":"Animals tread softly upon the earth without shoes, so all other living beings should follow suit."}
{"updated_label":"fallacy of credibility","source_article":"This herbal supplement is made from a plant that grows in Zambia. It must be healthier than taking that medication, which is full of chemicals I can't pronounce."}
{"updated_label":"fallacy of credibility","source_article":"Christina's shoes are superior, because they're made from one hundred percent snakeskin, not synthetic materials."}
{"updated_label":"fallacy of credibility","source_article":"The medicine man rolled into town on his bandwagon offering various natural remedies, such as very special plain water. He said that it was only natural that people should be wary of 'artificial' medicines such as antibiotics."}
{"updated_label":"fallacy of credibility","source_article":"I shop at Natural Happy Sunshine Store (NHSS), which is much better than your grocery store because at NHSS everything is natural including the 38-year-old store manager’s long gray hair and saggy breasts."}
{"updated_label":"fallacy of credibility","source_article":"Everyone in our family has gone to the University of Tennessee, so you need to apply to UT."}
{"updated_label":"fallacy of credibility","source_article":"'Our family has always been farmers, so we should always be farmers'' is an example of which logical fallacy?"}
{"updated_label":"fallacy of credibility","source_article":"We're going to celebrate New Year's Eve this way because that's how we've always done it.\r\nThis is an example of ..."}
{"updated_label":"fallacy of credibility","source_article":"Marriage has traditionally been between a man and a woman; therefore, gay marriage should not be allowed."}
{"updated_label":"fallacy of credibility","source_article":"Of course we should buy an Apple computer whenever we need a new computer. We have been buying Apple as far back as anyone can remember!"}
{"updated_label":"fallacy of credibility","source_article":"If we allow cadets to apply for encampment online, we’d save everyone lots of headaches. REPLY: No. We’ve always made cadets apply using a paper form."}
{"updated_label":"fallacy of credibility","source_article":"We should offer movies on our company’s website. REPLY: No, we’ve built our company’s fortune by renting movies only through our stores."}
{"updated_label":"fallacy of credibility","source_article":"X has been around for years now.\r\nY is new.\r\nTherefore, Y is better than X."}
{"updated_label":"fallacy of credibility","source_article":"I have been around the block many times, and I have had my share of success.  So believe me when I tell you that there is no better hobby than cat-juggling."}
{"updated_label":"fallacy of credibility","source_article":"I hold a doctorate in theology, have written 12 books, and personally met the Pope.  Therefore, when I say that Jesus’ favorite snack was raisins dipped in wine, you should believe me."}
{"updated_label":"fallacy of credibility","source_article":"There is no intervention for victims of domestic violence that has more empirical support from controlled studies than this one. It is clear that this is the right way to address this problem and we should all be providing this therapy whenever victims of domestic violence come to us for help."}
{"updated_label":"fallacy of credibility","source_article":"Nature gives people diseases and sickness; therefore, it is morally wrong to interfere with nature and treat sick people with medicine."}
{"updated_label":"fallacy of credibility","source_article":"You should eat more green leafy vegetables, because Ms. Lord says so, and she is an expert on grammar and vocabulary."}
{"updated_label":"fallacy of credibility","source_article":"My cousin Bob works as a mechanic at Oil Changers and he says that renewable energy sources, such as solar and wind power, aren't going to provide any help in fixing our nation's energy crisis."}
{"updated_label":"fallacy of credibility","source_article":"There is definitely a link between autism and the vaccines given to toddlers. I know this because a Wikipedia entry mentioned numerous studies that found this to be true."}
{"updated_label":"fallacy of credibility","source_article":"Michael Jordan wears Hanes underwear, so you should too!"}
{"updated_label":"fallacy of credibility","source_article":"There is definitely a link between dementia and drinking energy drinks. I read about it on Wikipedia."}
{"updated_label":"fallacy of credibility","source_article":"The owner of the car dealership by my house told me I need a new car, and he would know since he works in the industry."}
{"updated_label":"fallacy of credibility","source_article":"\"We're going to protest and not get in trouble because Mr. Iglesias said it's okay.\""}
{"updated_label":"fallacy of credibility","source_article":"\"My dad is a mechanic and he says that eating brushing your teeth twice a day is good for you. Since he is a mechanic, he knows best.\""}
{"updated_label":"fallacy of credibility","source_article":"My father told me that the sky is green. So it must be the truth."}
{"updated_label":"fallacy of credibility","source_article":"My uncle is a mechanic and he says you shouldn't spank children. He says it's ineffective."}
{"updated_label":"fallacy of credibility","source_article":"I think scientists are wrong. There is no such thing as global warming. I just finished talking to my boss, and he thought the idea was ridiculous."}
{"updated_label":"fallacy of credibility","source_article":"I don’t care what scientists say, my mother always told me that the world is flat, and she would never lie to me!"}
{"updated_label":"fallacy of credibility","source_article":"Coke is not as healthy for you as Pepsi. Besides, Britney Spears drinks Pepsi, so it must be healthier than Coke."}
{"updated_label":"fallacy of credibility","source_article":"\"My brother's girlfriend's Mother's hairdresser said that COVID numbers are going down, so I'm not going to bother with my mask\" IS an example of this fallacy."}
{"updated_label":"fallacy of credibility","source_article":"I'm not a doctor, but I play one on the hit series, \"Bimbos and Studmuffins in the OR.\" You can take it from me that when you need a safe and effective pain killer, there is nothing better then MorphiPill 2000. That is my professional medical opinion."}
{"updated_label":"fallacy of credibility","source_article":"\"The logic teacher was hired to fill the new computer animation class. He is a great admirer of Pixar's work and will do a great job.\""}
{"updated_label":"fallacy of credibility","source_article":"\"The art teacher spoke in the trial as a witness in support of testing perfumes on animals, and he persuaded me.\""}
{"updated_label":"fallacy of credibility","source_article":"\"My best friend tweeted about the health benefits of pizza, and so we're going to out to eat two vegetable pizzas tonight.\""}
{"updated_label":"fallacy of credibility","source_article":"My neighbor told me that the position of the sun, moon, and stars decide our personalities. I believe her because she is a famous violin player."}
{"updated_label":"fallacy of credibility","source_article":"Aaron Rodgers says you should get State Farm Insurance on your home, car, motorcycle, or trailer!"}
{"updated_label":"fallacy of credibility","source_article":"I’m not a doctor, but I play a doctor on TV, and I wouldn’t dream of using anything but Tylenol for my toughest headaches. "}
{"updated_label":"fallacy of credibility","source_article":"U.S. Sen. Tom Coburn says that lesbianism is rampant in the Oklahoma schools. This must, indeed, be true, because surely the senator couldn't be mistaken about the schools in his own state."}
{"updated_label":"faulty generalization","source_article":"You smoke pot? If you keep doing that, you’ll be a heroin addict within two years."}
{"updated_label":"faulty generalization","source_article":"My grandmother smoked for 80 years and died at 100. Obviously, smoking isn’t harmful."}
{"updated_label":"faulty generalization","source_article":"I know five people from Kentucky. They are all racists. Therefore, Kentuckians are racist."}
{"updated_label":"faulty generalization","source_article":"My neighbor’s child was kidnapped while playing alone in her yard. My city must be a dangerous place for children."}
{"updated_label":"faulty generalization","source_article":"I know four poor families. They are lazy drug addicts. Therefore, all poor people are lazy drug addicts."}
{"updated_label":"false causality","source_article":"The administration of echinocandins in this patient has been a very successful choice. Fever has subsided, along with the rest of the septic manifestations, in less than 48 hours. The chronological correlation suffices for me. I am convinced it was a fungal infection."}
{"updated_label":"false causality","source_article":"Every time we sacrifice virgins, it rains. Therefore, sacrificing virgins causes it to rain."}
{"updated_label":"false causality","source_article":"Violence among teens has risen the last five years. Video game playing among teens has also risen the last five years. Therefore, playing video games causes teens to be violent."}
{"updated_label":"false causality","source_article":"Every time I wear this necklace, I pass my exams. Therefore, wearing this necklace causes me to pass my exams."}
{"updated_label":"false causality","source_article":"Every person who has ever drunk water has died. Therefore, drinking water causes death."}
{"updated_label":"false causality","source_article":"Utah passed a strict gun-control law, and crime there decreased. Therefore, gun-control laws decrease crime."}
{"updated_label":"false causality","source_article":"“President Jones raised taxes, and then the rate of violent crime went up. Jones is responsible for the rise in crime.”"}
{"updated_label":"false causality","source_article":"I go to my front porch every morning and yell, “May no tigers enter this house!” and for 20 years, not a single tiger has entered my house. My tiger prevention strategy clearly works."}
{"updated_label":"false causality","source_article":"It’s cold on a summer day. Global warming is a hoax."}
{"updated_label":"false causality","source_article":"I’ve never had the flu because I take my vitamins everyday."}
{"updated_label":"circular reasoning","source_article":"I view any discussion concerning the limiting of therapy as morally wrong, that is why I do not accept it."}
{"updated_label":"circular reasoning","source_article":"Speaker 1: You should trust the Bible because it’s the Word of God.\r\r\nSpeaker 2: How do you know it’s the Word of God?\r\r\nSpeaker 1: Because God tells us it is.\r\r\nSpeaker 2: Where does God tell us this?\r\r\nSpeaker 1: Right here, in the Bible."}
{"updated_label":"fallacy of logic","source_article":"If Hunter was human, he would be mortal. Hunter is mortal. Therefore, Hunter is a human."}
{"updated_label":"fallacy of logic","source_article":"If it was raining outside, it would be dark. It’s dark outside, so it must be raining."}
{"updated_label":"fallacy of logic","source_article":"If I’m psychic, I will be able to see dead people. I see dead people, therefore I’m psychic."}
{"updated_label":"fallacy of logic","source_article":"Gus is Christian or Gus is politically liberal.\r\r\nGus is a Christian.\r\r\nTherefore, Gus is not politically liberal."}
{"updated_label":"fallacy of logic","source_article":"Either God created the world or evolution happened.\r\r\nEvolution happened.\r\r\nTherefore, God did not create the world."}
{"updated_label":"fallacy of logic","source_article":"Bruce is American, or he is not from New Jersey.\r\r\nBruce is not American, therefore, he is not from New Jersey."}
{"updated_label":"fallacy of logic","source_article":"It is possible aliens built the pyramids. Therefore, aliens built the pyramids."}
{"updated_label":"fallacy of logic","source_article":"It is possible to fake the moon landing through special effects. Therefore, the moon landing was a fake using special effects."}
{"updated_label":"fallacy of logic","source_article":"It’s possible to pass the class without attending regularly. Therefore, you will pass even if you don’t attend regularly."}
{"updated_label":"fallacy of logic","source_article":"People like to walk on the beach. Beaches have sand. We should put sand on the floor in our living room."}
{"updated_label":"appeal to emotion","source_article":"\"Then we had a death. A 32-year-old woman hemorrhaged to death as a result of a cervical laceration. I finally realized, we weren't helping women - we were destroying them.\""}
{"updated_label":"appeal to emotion","source_article":"\"If you have never been born again, eternal separation from God in the Lake of Fire awaits you. If you are born again, then being with the Lord in heaven forever is your destiny. Which do you choose?\""}
{"updated_label":"appeal to emotion","source_article":"“I know the exam is graded based on performance, but you should give me an A. My cat has been sick, my car broke down, and I’ve had a cold, so it was really hard for me to study!”"}
{"updated_label":"appeal to emotion","source_article":"“It’s wrong to tax corporations—think of all the money they give to charity, and think of the costs they already pay to run their businesses!”"}
{"updated_label":"appeal to emotion","source_article":"You should give me a promotion. I have a lot of debt and am behind on my rent."}
{"updated_label":"appeal to emotion","source_article":"You can’t give me a C. I’ll lose my scholarship."}
{"updated_label":"appeal to emotion","source_article":"I can’t take home a B in this course. My parents will be angry with me."}
{"updated_label":"appeal to emotion","source_article":"If you don’t give me a passing grade, I won’t get accepted to medical school. That will break my grandmother’s heart."}
{"updated_label":"appeal to emotion","source_article":"You should marry me. I know we’re not compatible, but I only have a year to live, and you’re my last chance."}
{"updated_label":"appeal to emotion","source_article":"If you choose not to administer triple antibiotic coverage for this patient with severe and extensive burns, you will be held responsible for any infectious complications that might eventually arise."}
{"updated_label":"false dilemma","source_article":"\"Every person is either my enemy or my friend. If are my enemy I should hate them. If they are my friend I should love them So I should either love them or hate them.\""}
{"updated_label":"false dilemma","source_article":"“Caldwell Hall is in bad shape. Either we tear it down and put up a new building, or we continue to risk students’ safety. Obviously we shouldn’t risk anyone’s safety, so we must tear the building down.”"}
{"updated_label":"false dilemma","source_article":"If you aren’t a capitalist, you must be a communist."}
{"updated_label":"false dilemma","source_article":"Speaker 1: I’m against the war.\r\r\nSpeaker 2: You must hate our troops."}
{"updated_label":"false dilemma","source_article":"You can either support our police or Black Lives Matter."}
{"updated_label":"fallacy of credibility","source_article":"“We should abolish the death penalty. Many respected people, such as actor Guy Handsome, have publicly stated their opposition to it.”"}
{"updated_label":"fallacy of credibility","source_article":"Professor X holds that the use of non-invasive ventilation has no place in the management of ARDS; this, therefore, is the approach we should adopt."}
{"updated_label":"fallacy of credibility","source_article":"My philosophy professor believes in ghosts and goes to séances. She’s an intelligent, educated, person, so ghosts must be real, and spiritualism must be true."}
{"updated_label":"fallacy of credibility","source_article":"My minister says the Covid vaccine will cause genetic mutations. He has a college degree, and is a holy man, so he must be right."}
{"updated_label":"fallacy of credibility","source_article":"Aristotle thought women were inferior to men. Aristotle is one of the smartest men who ever lived, so he must be right about this."}
{"updated_label":"fallacy of credibility","source_article":"I have no intention of stopping the use of somatostatin on patients suffering from acute pancreatitis. I consider it to be a very reasonable choice. After all, it has been standard practice in our department for many years and we’ve been quite satisfied with the results we’ve had."}
{"updated_label":"faulty generalization","source_article":"My friend swears the mechanic at that shop overcharged her last week and after looking at her invoice it seems she’s right. So don’t take your business there, as you’ll definitely get ripped off."}
{"updated_label":"faulty generalization","source_article":"All Greek food causes illness;  when I traveled through Greece, I got food  poisoning."}
{"updated_label":"faulty generalization","source_article":"All engineers are introverts who would rather relate to computers than people. "}
{"updated_label":"faulty generalization","source_article":"All football players are dumb jocks."}
{"updated_label":"faulty generalization","source_article":"Gas prices have been rising steadily these past few years. Thus, the cost of car ownership is higher than it was previously."}
{"updated_label":"faulty generalization","source_article":"The United States is the wealthiest nation in the world. So every American is wealthy."}
{"updated_label":"faulty generalization","source_article":"If you miss practice, it means you were probably goofing off. People who goof off drop out of school and end up penniless."}
{"updated_label":"faulty generalization","source_article":"But you have to let me go to the party! If I don't go to the party, I'll be a loser with no friends. Next thing you know, I'll end up alone and jobless, living in your basement when I'm 30!"}
{"updated_label":"faulty generalization","source_article":"If we put limits on the right to bear arms, soon all of our Constitutionally-given  rights will be taken away."}
{"updated_label":"faulty generalization","source_article":"Since many of the students at St. Cloud State University get A's, St. Cloud State must  be a top-rated school."}
{"updated_label":"faulty generalization","source_article":"IBM is a reputable organization, so all of its employees must be reputable."}
{"updated_label":"faulty generalization","source_article":"Duke University has the best basketball player in the NCAA, therefore they will win the tournament this year."}
{"updated_label":"faulty generalization","source_article":"Ten years ago I got a 170 on the LSAT, so I expect to get the same score again."}
{"updated_label":"faulty generalization","source_article":"The last Democrat winner of the New Hampshire primary won the general election. This year, the winner of the New Hampshire primary will win the general election."}
{"updated_label":"faulty generalization","source_article":"The more things change, the more they remain the same."}
{"updated_label":"false causality","source_article":"Every time that rooster crows, the sun comes up. That rooster must be very powerful and important!"}
{"updated_label":"false causality","source_article":"I believe in supernatural beings because every time I drive past the cemetery where  my grandmother is buried, a light on my dashboard flashes.  Her spirit causes this because it never happens otherwise."}
{"updated_label":"circular reasoning","source_article":"I must be telling the truth, since I’m not lying."}
{"updated_label":"circular reasoning","source_article":"Everything I say is true. This is true because I said it, and everything I say is true."}
{"updated_label":"circular reasoning","source_article":"God exists because the Bible says so. The Bible is a reliable source because it is the  word of God."}
{"updated_label":"circular reasoning","source_article":"Smoking pot is against the law because it's wrong; I know it's wrong because it is against the law."}
{"updated_label":"circular reasoning","source_article":"According to my brain, my brain is reliable."}
{"updated_label":"fallacy of logic","source_article":"The house is white; therefore it must be big"}
{"updated_label":"fallacy of logic","source_article":"If one is 16 years old or older, one can drive an automobile in Wisconsin.  I saw  your niece driving through Wausau yesterday.  She must be at least 16."}
{"updated_label":"fallacy of logic","source_article":"Mayor: During my previous term as mayor my staff and I spent a great deal of time focusing on our city’s economy, and unemployment reached an all-time high as a result. So clearly you should support my re-election campaign if you are among those still looking for a job."}
{"updated_label":"fallacy of logic","source_article":"All judges are fair-minded individuals;  therefore, Judge Ito is fair in his decisions."}
{"updated_label":"fallacy of logic","source_article":"If the ozone layer is destroyed, many people will get cancer and suffer from other illnesses.  The ozone layer is being protected, not destroyed.  So, many people will be spared the pain of cancer and other illnesses."}
{"updated_label":"appeal to emotion","source_article":"You have to give me a passing grade. I spent 150 hours on that project and missed every party this quarter."}
{"updated_label":"appeal to emotion","source_article":"Professor, please, PLEASE reconsider my grade on the Final! I know I only answered 7% of the questions correctly, but I didn’t really deserve an F! In the past week I sprained my ankle, my dog ran away, and my kitchen caught on fire! I think it’s only fair I get a chance to retake the test!"}
{"updated_label":"appeal to emotion","source_article":"I cannot get a job because the public education system failed me;  I have to steal to  survive.  It is society's fault, not mine."}
{"updated_label":"appeal to emotion","source_article":"If you don’t agree to sign the labor agreement, we’ll fire you."}
{"updated_label":"appeal to emotion","source_article":"If you do not believe in God, you will go to hell."}
{"updated_label":"false dilemma","source_article":"In the United States, one can vote for either Democrats or Republicans."}
{"updated_label":"false dilemma","source_article":"Either we go to war or we appear weak."}
{"updated_label":"false dilemma","source_article":"Either you love me or you hate me."}
{"updated_label":"false dilemma","source_article":"Either you are with me or you are against me."}
{"updated_label":"false dilemma","source_article":"Either you believe what I’m saying, or you must believe exactly the opposite."}
{"updated_label":"false dilemma","source_article":"In the United States, one can vote for either Democrats or Republicans."}
{"updated_label":"false dilemma","source_article":"Don’t waste your money on a home security system; master thieves will still be able to get into your house."}
{"updated_label":"fallacy of credibility","source_article":"People have believed that fish is \"brain food\" for decades, so I don't believe the  FDA when they claim that eating fish does not enhance the intellect."}
{"updated_label":"fallacy of credibility","source_article":"I think that businesses should not have to limit the amount of pollutants they  release into the atmosphere because Rush Limbaugh says that there is no real  evidence for industrial pollutants causing the Greenhouse Effect."}
{"updated_label":"fallacy of credibility","source_article":"Because Martin Sheen played the president on television, he'd probably make a great president in real life."}
{"updated_label":"fallacy of credibility","source_article":"One day robots will enslave us all. It's true. My computer science teacher says so."}
{"updated_label":"fallacy of credibility","source_article":"John agrees with me that drinking energy drinks are bad for you. "}
{"updated_label":"fallacy of credibility","source_article":"Word processed papers are clearer and more error-free than typed papers  because they make use of new technology."}
{"updated_label":"faulty generalization","source_article":"10 of the last 14 National Spelling Bee Champions have been Indian American. Indian Americans must all be great spellers!"}
{"updated_label":"faulty generalization","source_article":"Some teenagers in our community recently vandalized the park downtown. Teenagers are so irresponsible and destructive."}
{"updated_label":"circular reasoning","source_article":"This legislation is sinful because it is the wrong thing to do."}
{"updated_label":"false dilemma","source_article":"Either we pass this ordinance or there will be rioting in the streets."}
{"updated_label":"false dilemma","source_article":"If you are not with us, you are against us."}
{"updated_label":"false causality","source_article":"My child was diagnosed with autism after receiving vaccinations. That is proof that vaccines are to blame."}
{"updated_label":"fallacy of logic","source_article":"I hear the rain falling outside my window; therefore, the sun is not shining."}
{"updated_label":"appeal to emotion","source_article":"Without this additional insurance, you could find yourself broke and homeless."}
{"updated_label":"appeal to emotion","source_article":"I know I missed assignments, but if you fail me, I will lose my financial aid and have to drop out."}
{"updated_label":"faulty generalization","source_article":"We can’t legalize marijuana; if we do, then the next thing you know people will be strung out on heroin."}
{"updated_label":"fallacy of credibility","source_article":"Dr. X is an engineer, and he doesn’t believe in global warming."}
{"updated_label":"faulty generalization","source_article":"This crash will likely damage the reputation of Malaysia Airlines, which will hurt the tourism industry of Malaysia and ruin their economy."}
{"updated_label":"circular reasoning","source_article":"“The best minds in physics have studied physics most of their lives, as it’s necessary to study physics extensively to become a top physicist.”"}
{"updated_label":"circular reasoning","source_article":"“You should always do what you are being told because following the rules is important.”"}
{"updated_label":"circular reasoning","source_article":"“It’s important to argue logically because logic is an essential part of argumentation.”"}
{"updated_label":"fallacy of logic","source_article":"Putting teenagers in sex-education classes is like taking an alcoholic to a bar."}
{"updated_label":"fallacy of logic","source_article":"Premise: All black bears are omnivores.\r\r\n\r\r\nPremise: All raccoons are omnivores.\r\r\n\r\r\nConclusion: All raccoons are black bears."}
{"updated_label":"fallacy of credibility","source_article":"My dad went to school, so he knows everything about the education system."}
{"updated_label":"fallacy of logic","source_article":"You let my sister pierce her ears when she was 11, so you should let me stay up until midnight."}
{"updated_label":"false causality","source_article":"The number of pirates in existence decreased as the global average temperature rose. Therefore, we can conclude that hotter weather reduces piracy."}
{"updated_label":"false causality","source_article":"Mr. Casal got sick last week, so it was likely due to the students."}
{"updated_label":"false dilemma","source_article":"Our competitors use unhealthy sugar substitutes and artificial sweeteners. But Rev-Up Energy Drink contains one hundred percent real cane sugar to fuel your body better."}
{"updated_label":"circular reasoning","source_article":"I don't believe in God. One reason is that I think he is evil. And by the way, there is no such thing as \"evil;\" it is just our evaluation of what we believe is wrong."}
{"updated_label":"circular reasoning","source_article":"Jen: Don’t you realize that all this drinking you are doing is making your family miserable?\r\nBridget: Yes, I do.\r\nJen: Then what are you doing about it?\r\nBridget: Drinking to forget.\r\n"}